IOsetting/py32f0-template/Misc/py32f072xx.svd
				<register>
					<name>MCR</name>
					<description>desc MCR</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x900080</resetValue>
					<fields>
						<field>
							<name>BUSOFF</name>
							<description>desc BUSOFF</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>LBMI</name>
							<description>desc LBMI</description>
							<msb>5</msb>
							<lsb>5</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>LBME</name>
							<description>desc LBME</description>
							<msb>6</msb>
							<lsb>6</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>RESET</name>
							<description>desc RESET</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSA</name>
							<description>desc TSA</description>
							<msb>8</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSALL</name>
							<description>desc TSALL</description>
							<msb>9</msb>
							<lsb>9</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSONE</name>
							<description>desc TSONE</description>
							<msb>10</msb>
							<lsb>10</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TPA</name>
							<description>desc TPA</description>
							<msb>11</msb>
							<lsb>11</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TPE</name>
							<description>desc TPE</description>
							<msb>12</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>STBY</name>
							<description>desc STBY</description>
							<msb>13</msb>
							<lsb>13</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>LOM</name>
							<description>desc LOM</description>
							<msb>14</msb>
							<lsb>14</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TBSEL</name>
							<description>desc TBSEL</description>
							<msb>15</msb>
							<lsb>15</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSSTAT</name>
							<description>desc TSSTAT</description>
							<msb>17</msb>
							<lsb>16</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>TSFF</name>
							<description>desc TSFF</description>
							<msb>18</msb>
							<lsb>18</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>TTTBM</name>
							<description>desc TTTBM</description>
							<msb>20</msb>
							<lsb>20</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSMODE</name>
							<description>desc TSMODE</description>
							<msb>21</msb>
							<lsb>21</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSNEXT</name>
							<description>desc TSNEXT</description>
							<msb>22</msb>
							<lsb>22</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>FD_ISO</name>
							<description>desc FD_ISO</description>
							<msb>23</msb>
							<lsb>23</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>RSTAT</name>
							<description>desc RSTAT</description>
							<msb>25</msb>
							<lsb>24</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>RBALL</name>
							<description>desc RBALL</description>
							<msb>27</msb>
							<lsb>27</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>RREL</name>
							<description>desc RREL</description>
							<msb>28</msb>
							<lsb>28</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ROV</name>
							<description>desc ROV</description>
							<msb>29</msb>
							<lsb>29</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>ROM</name>
							<description>desc ROM</description>
							<msb>30</msb>
							<lsb>30</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>SACK</name>
							<description>desc SACK</description>
							<msb>31</msb>
							<lsb>31</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WECR</name>
					<description>desc WECR</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1B</resetValue>
					<fields>
						<field>
							<name>EWL</name>
							<description>desc EWL</description>
							<msb>3</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>AFWL</name>
							<description>desc AFWL</description>
							<msb>7</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ALC</name>
							<description>desc ALC</description>
							<msb>12</msb>
							<lsb>8</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>KOER</name>
							<description>desc KOER</description>
							<msb>15</msb>
							<lsb>13</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>RECNT</name>
							<description>desc RECNT</description>
							<msb>23</msb>
							<lsb>16</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>TECNT</name>
							<description>desc TECNT</description>
							<msb>31</msb>
							<lsb>24</lsb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>REFMSG</name>
					<description>desc REFMSG</description>
					<addressOffset>0x30</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>REF_ID</name>
							<description>desc REF_ID</description>
							<msb>28</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>REF_IDE</name>
							<description>desc REF_IDE</description>
							<msb>31</msb>
							<lsb>31</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TTCR</name>
					<description>desc TTCR</description>
					<addressOffset>0x34</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>TTPTR</name>
							<description>desc TTPTR</description>
							<msb>5</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TTYPE</name>
							<description>desc TTYPE</description>
							<msb>10</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TEW</name>
							<description>desc TEW</description>
							<msb>15</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TBPTR</name>
							<description>desc TBPTR</description>
							<msb>21</msb>
							<lsb>16</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TBF</name>
							<description>desc TBF</description>
							<msb>22</msb>
							<lsb>22</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TBE</name>
							<description>desc TBE</description>
							<msb>23</msb>
							<lsb>23</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TTEN</name>
							<description>desc TTEN</description>
							<msb>24</msb>
							<lsb>24</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>T_PRESC</name>
							<description>desc T_PRESC</description>
							<msb>26</msb>
							<lsb>25</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TTTR</name>
					<description>desc TTTR</description>
					<addressOffset>0x38</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xFFFF0000</resetValue>
					<fields>
						<field>
							<name>TT_TRIG</name>
							<description>desc TT_TRIG</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TT_WTRIG</name>
							<description>desc TT_WTRIG</description>
							<msb>31</msb>
							<lsb>16</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SCMS</name>
					<description>desc SCMS</description>
					<addressOffset>0x3C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>XMREN</name>
							<description>desc XMREN</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>FSTIM</name>
							<description>desc FSTIM</description>
							<msb>3</msb>
							<lsb>1</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ACFA</name>
							<description>desc ACFA</description>
							<msb>24</msb>
							<lsb>24</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXS</name>
							<description>desc TXS</description>
							<msb>25</msb>
							<lsb>25</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXB</name>
							<description>desc TXB</description>
							<msb>26</msb>
							<lsb>26</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>HELOC</name>
							<description>desc HELOC</description>
							<msb>28</msb>
							<lsb>27</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>MPEN</name>
							<description>desc MPEN</description>
							<msb>31</msb>
							<lsb>31</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MESR</name>
					<description>desc MESR</description>
					<addressOffset>0x40</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>MEBP1</name>
							<description>desc MEBP1</description>
							<msb>5</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ME1EE</name>
							<description>desc ME1EE</description>
							<msb>6</msb>
							<lsb>6</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>MEAEE</name>
							<description>desc MEAEE</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>MEBP2</name>
							<description>desc MEBP2</description>
							<msb>13</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ME2EE</name>
							<description>desc ME2EE</description>
							<msb>14</msb>
							<lsb>14</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>MEEEC</name>
							<description>desc MEEEC</description>
							<msb>19</msb>
							<lsb>16</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>MENEC</name>
							<description>desc MENEC</description>
							<msb>23</msb>
							<lsb>20</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>MEL</name>
							<description>desc MEL</description>
							<msb>25</msb>
							<lsb>24</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>MES</name>
							<description>desc MES</description>
							<msb>26</msb>
							<lsb>26</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ACFCR</name>
					<description>desc ACFCR</description>
					<addressOffset>0x44</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x10000</resetValue>
					<fields>
						<field>
							<name>ACFADR</name>
							<description>desc ACFADR</description>
							<msb>3</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>AE_0</name>
							<description>desc AE_0</description>
							<msb>16</msb>
							<lsb>16</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>AE_1</name>
							<description>desc AE_1</description>
							<msb>17</msb>
							<lsb>17</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>AE_2</name>
							<description>desc AE_2</description>
							<msb>18</msb>
							<lsb>18</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>AE_3</name>
							<description>desc AE_3</description>
							<msb>19</msb>
							<lsb>19</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>AE_4</name>
							<description>desc AE_4</description>
							<msb>20</msb>
							<lsb>20</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>AE_5</name>
							<description>desc AE_5</description>
							<msb>21</msb>
							<lsb>21</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>AE_6</name>
							<description>desc AE_6</description>
							<msb>22</msb>
							<lsb>22</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>AE_7</name>
							<description>desc AE_7</description>
							<msb>23</msb>
							<lsb>23</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>AE_8</name>
							<description>desc AE_8</description>
							<msb>24</msb>
							<lsb>24</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>AE_9</name>
							<description>desc AE_9</description>
							<msb>25</msb>
							<lsb>25</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>AE_10</name>
							<description>desc AE_10</description>
							<msb>26</msb>
							<lsb>26</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>AE_11</name>
							<description>desc AE_11</description>
							<msb>27</msb>
							<lsb>27</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>AE_12</name>
							<description>desc AE_12</description>
							<msb>28</msb>
							<lsb>28</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>AE_13</name>
							<description>desc AE_13</description>
							<msb>29</msb>
							<lsb>29</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>AE_14</name>
							<description>desc AE_14</description>
							<msb>30</msb>
							<lsb>30</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>AE_15</name>
							<description>desc AE_15</description>
							<msb>31</msb>
							<lsb>31</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PWMCR</name>
					<description>desc PWMCR</description>
					<addressOffset>0xB8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x2080400</resetValue>
					<fields>
						<field>
							<name>PWMO</name>
							<description>desc PWMO</description>
							<msb>5</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PWMS</name>
							<description>desc PWMS</description>
							<msb>13</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PWML</name>
							<description>desc PWML</description>
							<msb>21</msb>
							<lsb>16</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
