IOsetting/py32f0-template/Misc/py32f072xx.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>COMP1</name>
			<description>Comparator 1</description>
			<groupName>COMP</groupName>
			<baseAddress>0x40010200</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x10</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>ADC_COMP</name>
				<description>ADC and COMP Interrupt through EXTI Lines 17 and 18</description>
				<value>12</value>
			</interrupt>
			<registers>
				<register>
					<name>CSR</name>
					<displayName>CSR</displayName>
					<description>COMP control and status register</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>COMP_OUT</name>
							<description>Comparator output status</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>VCSEL</name>
							<description>VCSEL</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>VCDIV_EN</name>
							<description>VCDIV_EN</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>VCDIV</name>
							<description>VCDIV</description>
							<bitOffset>20</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>PWRMODE</name>
							<description>
								Comparator power mode
								selector
							</description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>HYST</name>
							<description>
								Comparator hysteresis enable
								selector
							</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>POLARITY</name>
							<description>
								Comparator polarity
								selector
							</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WINMODE</name>
							<description>
								Comparator non-inverting input
								selector for window mode
							</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>INPSEL</name>
							<description>
								Comparator signal selector for
								non-inverting input
							</description>
							<bitOffset>6</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>INMSEL</name>
							<description>
								Comparator signal selector for
								inverting input INM
							</description>
							<bitOffset>2</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EN</name>
							<description>COMP enable bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>FR</name>
					<displayName>FR</displayName>
					<description>
						Comparator Filter
						register
					</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FLTCNT1</name>
							<description>Comparator filter and counter</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>FLTEN1</name>
							<description>Filter enable bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>COMP2</name>
			<description>Comparator2</description>
			<groupName>COMP</groupName>
			<baseAddress>0x40010210</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x10</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>ADC_COMP</name>
				<description>ADC and COMP Interrupt through EXTI Lines 17 and 18</description>
				<value>12</value>
			</interrupt>
			<registers>
				<register>
					<name>CSR</name>
					<displayName>CSR</displayName>
					<description>COMP control and status register</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>COMP_OUT</name>
							<description>Comparator output status</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PWRMODE</name>
							<description>
								Comparator power mode
								selector
							</description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>POLARITY</name>
							<description>
								Comparator polarity
								selector
							</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WINMODE</name>
							<description>
								Comparator non-inverting input
								selector for window mode
							</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>INPSEL</name>
							<description>
								Comparator signal selector for
								non-inverting input
							</description>
							<bitOffset>6</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>INMSEL</name>
							<description>
								Comparator signal selector for
								inverting input INM
							</description>
							<bitOffset>2</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>HYST</name>
							<description>
								Comparator hysteresis enable
								selector
							</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EN</name>
							<description>COMP enable bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>FR</name>
					<displayName>FR</displayName>
					<description>
						Comparator Filter
						register
					</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FLTCNT2</name>
							<description>Comparator filter and counter</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>FLTEN2</name>
							<description>Filter enable bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
