IOsetting/py32f0-template/Misc/py32f072xx.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>DBGMCU</name>
			<description>Debug support</description>
			<groupName>DBGMCU</groupName>
			<baseAddress>0x40015800</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>IDCODE</name>
					<displayName>IDCODE</displayName>
					<description>MCU Device ID Code Register</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>DBG_ID</name>
							<description>DBG_ID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>
						Debug MCU Configuration
						Register
					</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>DBG_SLEEP</name>
							<description>Debug Sleep Mode</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_STOP</name>
							<description>Debug Stop Mode</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>APB_FZ1</name>
					<displayName>APB_FZ1</displayName>
					<description>APB Freeze Register1</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>DBG_TIMER2_STOP</name>
							<description>
								Debug Timer 2 stopped when Core is
								halted
							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_TIMER3_STOP</name>
							<description>
								Debug Timer 3 stopped when Core is
								halted
							</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_TIMER6_STOP</name>
							<description>
								Debug Timer 6 stopped when Core is
								halted
							</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_TIMER7_STOP</name>
							<description>
								Debug Timer 7 stopped when Core is
								halted
							</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_RTC_STOP</name>
							<description>
								Debug RTC stopped when Core is
								halted
							</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_WWDG_STOP</name>
							<description>
								Debug Window Wachdog stopped when Core
								is halted
							</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_IWDG_STOP</name>
							<description>
								Debug Independent Wachdog stopped when
								Core is halted
							</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_CAN_STOP</name>
							<description>DBG_CAN_STOP</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_I2C1_SMBUS_TIMEOUT</name>
							<description>DBG_I2C1_SMBUS_TIMEOUT</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_I2C2_SMBUS_TIMEOUT</name>
							<description>DBG_I2C2_SMBUS_TIMEOUT</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DBG_LPTIM_STOP</name>
							<description>
								Debug LPTIM stopped when Core is
								halted
							</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>APB_FZ2</name>
					<displayName>APB_FZ2</displayName>
					<description>APB Freeze Register2</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>DBG_TIMER1_STOP</name>
							<description>
								Debug Timer 1 stopped when Core is
								halted
							</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_TIMER14_STOP</name>
							<description>
								Debug Timer 14 stopped when Core is
								halted
							</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_TIMER15_STOP</name>
							<description>
								Debug Timer 15 stopped when Core is
								halted
							</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_TIMER16_STOP</name>
							<description>
								Debug Timer 16 stopped when Core is
								halted
							</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_TIMER17_STOP</name>
							<description>
								Debug Timer 17 stopped when Core is
								halted
							</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>DV</name>
			<description>Divider</description>
			<groupName>DV</groupName>
			<baseAddress>0x40023800</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>DEND</name>
					<displayName>DEND</displayName>
					<description>Dividend</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>DEND</name>
							<description>Dividend</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SOR</name>
					<displayName>SOR</displayName>
					<description>Divisor</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>SOR</name>
							<description>Divisor</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>QUOT</name>
					<displayName>QUOT</displayName>
					<description>Quotient</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>QUOT</name>
							<description>Quotient</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>REMA</name>
					<displayName>REMA</displayName>
					<description>Remainder</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>REMA</name>
							<description>Remainder</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SIGN</name>
					<displayName>SIGN</displayName>
					<description>des SIGN</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>DIV_SIGN</name>
							<description>des DIV_SIGN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>STAT</name>
					<displayName>STAT</displayName>
					<description>des SIGN</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>DIV_END</name>
							<description>des DIV_END</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DIV_ZERO</name>
							<description>des DIV_ZERO</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
