IOsetting/py32f0-template/Misc/py32f072xx.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>DMA</name>
			<description>Direct memory access</description>
			<groupName>DMA</groupName>
			<baseAddress>0x40020000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>DMA1_Channel1</name>
				<description>DMA1 Channel 1 Interrupt</description>
				<value>9</value>
			</interrupt>
			<interrupt>
				<name>DMA1_Channel2_3</name>
				<description>DMA1 Channel 2 and Channel 3 Interrupt</description>
				<value>10</value>
			</interrupt>
			<interrupt>
				<name>DMA1_Channel4_5_6_7</name>
				<description>DMA1 Channel 4, 5, 6, 7 Interrupts</description>
				<value>11</value>
			</interrupt>
			<registers>
				<register>
					<name>ISR</name>
					<description>desc ISR</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>GIF1</name>
							<description>desc GIF1</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>TCIF1</name>
							<description>desc TCIF1</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>HTIF1</name>
							<description>desc HTIF1</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>TEIF1</name>
							<description>desc TEIF1</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>GIF2</name>
							<description>desc GIF2</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>TCIF2</name>
							<description>desc TCIF2</description>
							<msb>5</msb>
							<lsb>5</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>HTIF2</name>
							<description>desc HTIF2</description>
							<msb>6</msb>
							<lsb>6</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>TEIF2</name>
							<description>desc TEIF2</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>GIF3</name>
							<description>desc GIF3</description>
							<msb>8</msb>
							<lsb>8</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>TCIF3</name>
							<description>desc TCIF3</description>
							<msb>9</msb>
							<lsb>9</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>HTIF3</name>
							<description>desc HTIF3</description>
							<msb>10</msb>
							<lsb>10</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>TEIF3</name>
							<description>desc TEIF3</description>
							<msb>11</msb>
							<lsb>11</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>GIF4</name>
							<description>desc GIF4</description>
							<msb>12</msb>
							<lsb>12</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>TCIF4</name>
							<description>desc TCIF4</description>
							<msb>13</msb>
							<lsb>13</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>HTIF4</name>
							<description>desc HTIF4</description>
							<msb>14</msb>
							<lsb>14</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>TEIF4</name>
							<description>desc TEIF4</description>
							<msb>15</msb>
							<lsb>15</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>GIF5</name>
							<description>desc GIF5</description>
							<msb>16</msb>
							<lsb>16</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>TCIF5</name>
							<description>desc TCIF5</description>
							<msb>17</msb>
							<lsb>17</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>HTIF5</name>
							<description>desc HTIF5</description>
							<msb>18</msb>
							<lsb>18</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>TEIF5</name>
							<description>desc TEIF5</description>
							<msb>19</msb>
							<lsb>19</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>GIF6</name>
							<description>desc GIF6</description>
							<msb>20</msb>
							<lsb>20</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>TCIF6</name>
							<description>desc TCIF6</description>
							<msb>21</msb>
							<lsb>21</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>HTIF6</name>
							<description>desc HTIF6</description>
							<msb>22</msb>
							<lsb>22</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>TEIF6</name>
							<description>desc TEIF6</description>
							<msb>23</msb>
							<lsb>23</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>GIF7</name>
							<description>desc GIF7</description>
							<msb>24</msb>
							<lsb>24</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>TCIF7</name>
							<description>desc TCIF7</description>
							<msb>25</msb>
							<lsb>25</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>HTIF7</name>
							<description>desc HTIF7</description>
							<msb>26</msb>
							<lsb>26</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>TEIF7</name>
							<description>desc TEIF7</description>
							<msb>27</msb>
							<lsb>27</lsb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFCR</name>
					<description>desc IFCR</description>
					<addressOffset>0x4</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>CGIF1</name>
							<description>desc CGIF1</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CTCIF1</name>
							<description>desc CTCIF1</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CHTIF1</name>
							<description>desc CHTIF1</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CTEIF1</name>
							<description>desc CTEIF1</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CGIF2</name>
							<description>desc CGIF2</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CTCIF2</name>
							<description>desc CTCIF2</description>
							<msb>5</msb>
							<lsb>5</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CHTIF2</name>
							<description>desc CHTIF2</description>
							<msb>6</msb>
							<lsb>6</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CTEIF2</name>
							<description>desc CTEIF2</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CGIF3</name>
							<description>desc CGIF3</description>
							<msb>8</msb>
							<lsb>8</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CTCIF3</name>
							<description>desc CTCIF3</description>
							<msb>9</msb>
							<lsb>9</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CHTIF3</name>
							<description>desc CHTIF3</description>
							<msb>10</msb>
							<lsb>10</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CTEIF3</name>
							<description>desc CTEIF3</description>
							<msb>11</msb>
							<lsb>11</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CGIF4</name>
							<description>desc CGIF4</description>
							<msb>12</msb>
							<lsb>12</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CTCIF4</name>
							<description>desc CTCIF4</description>
							<msb>13</msb>
							<lsb>13</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CHTIF4</name>
							<description>desc CHTIF4</description>
							<msb>14</msb>
							<lsb>14</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CTEIF4</name>
							<description>desc CTEIF4</description>
							<msb>15</msb>
							<lsb>15</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CGIF5</name>
							<description>desc CGIF5</description>
							<msb>16</msb>
							<lsb>16</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CTCIF5</name>
							<description>desc CTCIF5</description>
							<msb>17</msb>
							<lsb>17</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CHTIF5</name>
							<description>desc CHTIF5</description>
							<msb>18</msb>
							<lsb>18</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CTEIF5</name>
							<description>desc CTEIF5</description>
							<msb>19</msb>
							<lsb>19</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CGIF6</name>
							<description>desc CGIF6</description>
							<msb>20</msb>
							<lsb>20</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CTCIF6</name>
							<description>desc CTCIF6</description>
							<msb>21</msb>
							<lsb>21</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CHTIF6</name>
							<description>desc CHTIF6</description>
							<msb>22</msb>
							<lsb>22</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CTEIF6</name>
							<description>desc CTEIF6</description>
							<msb>23</msb>
							<lsb>23</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CGIF7</name>
							<description>desc CGIF7</description>
							<msb>24</msb>
							<lsb>24</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CTCIF7</name>
							<description>desc CTCIF7</description>
							<msb>25</msb>
							<lsb>25</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CHTIF7</name>
							<description>desc CHTIF7</description>
							<msb>26</msb>
							<lsb>26</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CTEIF7</name>
							<description>desc CTEIF7</description>
							<msb>27</msb>
							<lsb>27</lsb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR1</name>
					<description>desc CCR1</description>
					<addressOffset>0x8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>EN</name>
							<description>desc EN</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TCIE</name>
							<description>desc TCIE</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>HTIE</name>
							<description>desc HTIE</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TEIE</name>
							<description>desc TEIE</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>DIR</name>
							<description>desc DIR</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CIRC</name>
							<description>desc CIRC</description>
							<msb>5</msb>
							<lsb>5</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PINC</name>
							<description>desc PINC</description>
							<msb>6</msb>
							<lsb>6</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>MINC</name>
							<description>desc MINC</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PSIZE</name>
							<description>desc PSIZE</description>
							<msb>9</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIZE</name>
							<description>desc MSIZE</description>
							<msb>11</msb>
							<lsb>10</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL</name>
							<description>desc PL</description>
							<msb>13</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>MEM2MEM</name>
							<description>desc MEM2MEM</description>
							<msb>14</msb>
							<lsb>14</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CNDTR1</name>
					<description>desc CNDTR1</description>
					<addressOffset>0xC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>NDT</name>
							<description>desc NDT</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CPAR1</name>
					<description>desc CPAR1</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>PA</name>
							<description>desc PA</description>
							<msb>31</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMAR1</name>
					<description>desc CMAR1</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>MA</name>
							<description>desc MA</description>
							<msb>31</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR2</name>
					<description>desc CCR2</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>EN</name>
							<description>desc EN</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TCIE</name>
							<description>desc TCIE</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>HTIE</name>
							<description>desc HTIE</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TEIE</name>
							<description>desc TEIE</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>DIR</name>
							<description>desc DIR</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CIRC</name>
							<description>desc CIRC</description>
							<msb>5</msb>
							<lsb>5</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PINC</name>
							<description>desc PINC</description>
							<msb>6</msb>
							<lsb>6</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>MINC</name>
							<description>desc MINC</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PSIZE</name>
							<description>desc PSIZE</description>
							<msb>9</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIZE</name>
							<description>desc MSIZE</description>
							<msb>11</msb>
							<lsb>10</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL</name>
							<description>desc PL</description>
							<msb>13</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>MEM2MEM</name>
							<description>desc MEM2MEM</description>
							<msb>14</msb>
							<lsb>14</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CNDTR2</name>
					<description>desc CNDTR2</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>NDT</name>
							<description>desc NDT</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CPAR2</name>
					<description>desc CPAR2</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>PA</name>
							<description>desc PA</description>
							<msb>31</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMAR2</name>
					<description>desc CMAR2</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>MA</name>
							<description>desc MA</description>
							<msb>31</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR3</name>
					<description>desc CCR3</description>
					<addressOffset>0x30</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>EN</name>
							<description>desc EN</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TCIE</name>
							<description>desc TCIE</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>HTIE</name>
							<description>desc HTIE</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TEIE</name>
							<description>desc TEIE</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>DIR</name>
							<description>desc DIR</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CIRC</name>
							<description>desc CIRC</description>
							<msb>5</msb>
							<lsb>5</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PINC</name>
							<description>desc PINC</description>
							<msb>6</msb>
							<lsb>6</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>MINC</name>
							<description>desc MINC</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PSIZE</name>
							<description>desc PSIZE</description>
							<msb>9</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIZE</name>
							<description>desc MSIZE</description>
							<msb>11</msb>
							<lsb>10</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL</name>
							<description>desc PL</description>
							<msb>13</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>MEM2MEM</name>
							<description>desc MEM2MEM</description>
							<msb>14</msb>
							<lsb>14</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CNDTR3</name>
					<description>desc CNDTR3</description>
					<addressOffset>0x34</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>NDT</name>
							<description>desc NDT</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CPAR3</name>
					<description>desc CPAR3</description>
					<addressOffset>0x38</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>PA</name>
							<description>desc PA</description>
							<msb>31</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMAR3</name>
					<description>desc CMAR3</description>
					<addressOffset>0x3C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>MA</name>
							<description>desc MA</description>
							<msb>31</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
