IOsetting/py32f0-template/Misc/py32f072xx.svd
				<register>
					<name>CCR4</name>
					<description>desc CCR4</description>
					<addressOffset>0x44</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>EN</name>
							<description>desc EN</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TCIE</name>
							<description>desc TCIE</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>HTIE</name>
							<description>desc HTIE</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TEIE</name>
							<description>desc TEIE</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>DIR</name>
							<description>desc DIR</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CIRC</name>
							<description>desc CIRC</description>
							<msb>5</msb>
							<lsb>5</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PINC</name>
							<description>desc PINC</description>
							<msb>6</msb>
							<lsb>6</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>MINC</name>
							<description>desc MINC</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PSIZE</name>
							<description>desc PSIZE</description>
							<msb>9</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIZE</name>
							<description>desc MSIZE</description>
							<msb>11</msb>
							<lsb>10</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL</name>
							<description>desc PL</description>
							<msb>13</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>MEM2MEM</name>
							<description>desc MEM2MEM</description>
							<msb>14</msb>
							<lsb>14</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CNDTR4</name>
					<description>desc CNDTR4</description>
					<addressOffset>0x48</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>NDT</name>
							<description>desc NDT</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CPAR4</name>
					<description>desc CPAR4</description>
					<addressOffset>0x4C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>PA</name>
							<description>desc PA</description>
							<msb>31</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMAR4</name>
					<description>desc CMAR4</description>
					<addressOffset>0x50</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>MA</name>
							<description>desc MA</description>
							<msb>31</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR5</name>
					<description>desc CCR5</description>
					<addressOffset>0x58</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>EN</name>
							<description>desc EN</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TCIE</name>
							<description>desc TCIE</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>HTIE</name>
							<description>desc HTIE</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TEIE</name>
							<description>desc TEIE</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>DIR</name>
							<description>desc DIR</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CIRC</name>
							<description>desc CIRC</description>
							<msb>5</msb>
							<lsb>5</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PINC</name>
							<description>desc PINC</description>
							<msb>6</msb>
							<lsb>6</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>MINC</name>
							<description>desc MINC</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PSIZE</name>
							<description>desc PSIZE</description>
							<msb>9</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIZE</name>
							<description>desc MSIZE</description>
							<msb>11</msb>
							<lsb>10</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL</name>
							<description>desc PL</description>
							<msb>13</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>MEM2MEM</name>
							<description>desc MEM2MEM</description>
							<msb>14</msb>
							<lsb>14</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CNDTR5</name>
					<description>desc CNDTR5</description>
					<addressOffset>0x5C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>NDT</name>
							<description>desc NDT</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CPAR5</name>
					<description>desc CPAR5</description>
					<addressOffset>0x60</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>PA</name>
							<description>desc PA</description>
							<msb>31</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMAR5</name>
					<description>desc CMAR5</description>
					<addressOffset>0x64</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>MA</name>
							<description>desc MA</description>
							<msb>31</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR6</name>
					<description>desc CCR6</description>
					<addressOffset>0x6C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>EN</name>
							<description>desc EN</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TCIE</name>
							<description>desc TCIE</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>HTIE</name>
							<description>desc HTIE</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TEIE</name>
							<description>desc TEIE</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>DIR</name>
							<description>desc DIR</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CIRC</name>
							<description>desc CIRC</description>
							<msb>5</msb>
							<lsb>5</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PINC</name>
							<description>desc PINC</description>
							<msb>6</msb>
							<lsb>6</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>MINC</name>
							<description>desc MINC</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PSIZE</name>
							<description>desc PSIZE</description>
							<msb>9</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIZE</name>
							<description>desc MSIZE</description>
							<msb>11</msb>
							<lsb>10</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL</name>
							<description>desc PL</description>
							<msb>13</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>MEM2MEM</name>
							<description>desc MEM2MEM</description>
							<msb>14</msb>
							<lsb>14</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CNDTR6</name>
					<description>desc CNDTR6</description>
					<addressOffset>0x70</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>NDT</name>
							<description>desc NDT</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CPAR6</name>
					<description>desc CPAR6</description>
					<addressOffset>0x74</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>PA</name>
							<description>desc PA</description>
							<msb>31</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMAR6</name>
					<description>desc CMAR6</description>
					<addressOffset>0x78</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>MA</name>
							<description>desc MA</description>
							<msb>31</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR7</name>
					<description>desc CCR7</description>
					<addressOffset>0x80</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>EN</name>
							<description>desc EN</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TCIE</name>
							<description>desc TCIE</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>HTIE</name>
							<description>desc HTIE</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TEIE</name>
							<description>desc TEIE</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>DIR</name>
							<description>desc DIR</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CIRC</name>
							<description>desc CIRC</description>
							<msb>5</msb>
							<lsb>5</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PINC</name>
							<description>desc PINC</description>
							<msb>6</msb>
							<lsb>6</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>MINC</name>
							<description>desc MINC</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PSIZE</name>
							<description>desc PSIZE</description>
							<msb>9</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIZE</name>
							<description>desc MSIZE</description>
							<msb>11</msb>
							<lsb>10</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL</name>
							<description>desc PL</description>
							<msb>13</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>MEM2MEM</name>
							<description>desc MEM2MEM</description>
							<msb>14</msb>
							<lsb>14</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CNDTR7</name>
					<description>desc CNDTR7</description>
					<addressOffset>0x84</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>NDT</name>
							<description>desc NDT</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CPAR7</name>
					<description>desc CPAR7</description>
					<addressOffset>0x88</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>PA</name>
							<description>desc PA</description>
							<msb>31</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMAR7</name>
					<description>desc CMAR7</description>
					<addressOffset>0x8C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>MA</name>
							<description>desc MA</description>
							<msb>31</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
