IOsetting/py32f0-template/Misc/py32f072xx.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>FLASH</name>
			<description>desc FLASH</description>
			<groupName>FLASH</groupName>
			<baseAddress>0x40022000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>FLASH</name>
				<description>FLASH global Interrupt</description>
				<value>3</value>
			</interrupt>
			<registers>
				<register>
					<name>ACR</name>
					<description>desc ACR</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x500</resetValue>
					<fields>
						<field>
							<name>LATENCY</name>
							<description>desc LATENCY</description>
							<msb>1</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRFTEN</name>
							<description>desc PRFTEN</description>
							<msb>8</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ICEN</name>
							<description>desc ICEN</description>
							<msb>9</msb>
							<lsb>9</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>DCEN</name>
							<description>desc DCEN</description>
							<msb>10</msb>
							<lsb>10</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KEYR</name>
					<description>desc KEYR</description>
					<addressOffset>0x8</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>KEY</name>
							<description>desc KEY</description>
							<msb>31</msb>
							<lsb>0</lsb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OPTKEYR</name>
					<description>desc OPTKEYR</description>
					<addressOffset>0xC</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>OPTKEY</name>
							<description>desc OPTKEY</description>
							<msb>31</msb>
							<lsb>0</lsb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SR</name>
					<description>desc SR</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>EOP</name>
							<description>desc EOP</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>WRPERR</name>
							<description>desc WRPERR</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OPTVERR</name>
							<description>desc OPTVERR</description>
							<msb>15</msb>
							<lsb>15</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>BSY</name>
							<description>desc BSY</description>
							<msb>16</msb>
							<lsb>16</lsb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CR</name>
					<description>desc CR</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>PG</name>
							<description>desc PG</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PER</name>
							<description>desc PER</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>MER</name>
							<description>desc MER</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>SER</name>
							<description>desc SER</description>
							<msb>11</msb>
							<lsb>11</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OPTSTRT</name>
							<description>desc OPTSTRT</description>
							<msb>17</msb>
							<lsb>17</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PGSTRT</name>
							<description>desc PGSTRT</description>
							<msb>19</msb>
							<lsb>19</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>EOPIE</name>
							<description>desc EOPIE</description>
							<msb>24</msb>
							<lsb>24</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ERRIE</name>
							<description>desc ERRIE</description>
							<msb>25</msb>
							<lsb>25</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OBL_LAUNCH</name>
							<description>desc OBL_LAUNCH</description>
							<msb>27</msb>
							<lsb>27</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OPTLOCK</name>
							<description>desc OPTLOCK</description>
							<msb>30</msb>
							<lsb>30</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>LOCK</name>
							<description>desc LOCK</description>
							<msb>31</msb>
							<lsb>31</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OPTR</name>
					<description>desc OPTR</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>RDP</name>
							<description>desc RDP</description>
							<msb>7</msb>
							<lsb>0</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>IWDG_SW</name>
							<description>desc IWDG_SW</description>
							<msb>11</msb>
							<lsb>11</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>WWDG_SW</name>
							<description>desc WWDG_SW</description>
							<msb>12</msb>
							<lsb>12</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>NRST_MODE</name>
							<description>desc NRST_MODE</description>
							<msb>13</msb>
							<lsb>13</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>NBOOT1</name>
							<description>desc nBOOT1</description>
							<msb>14</msb>
							<lsb>14</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>IWDG_STOP</name>
							<description>desc IWDG_STOP</description>
							<msb>15</msb>
							<lsb>15</lsb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SDKR</name>
					<description>desc SDKR</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>SDK_STRT</name>
							<description>desc SDK_STRT</description>
							<msb>4</msb>
							<lsb>0</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>BOR_EN</name>
							<description>desc BOR_EN</description>
							<msb>5</msb>
							<lsb>5</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>SDK_END</name>
							<description>desc SDK_END</description>
							<msb>12</msb>
							<lsb>8</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>BOR_LEV</name>
							<description>desc BOR_LEV</description>
							<msb>15</msb>
							<lsb>13</lsb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PCK_EN</name>
					<description>desc PCK_EN</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>USB_CLK_EN</name>
							<description>desc USB_CLK_EN</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>CAN_CLK_EN</name>
							<description>desc CAN_CLK_EN</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>TIM2_CLK_EN</name>
							<description>desc TIM2_CLK_EN</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>TIM3_CLK_EN</name>
							<description>desc TIM3_CLK_EN</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>TIM7_CLK_EN</name>
							<description>desc TIM7_CLK_EN</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>I2C2_CLK_EN</name>
							<description>desc I2C2_CLK_EN</description>
							<msb>5</msb>
							<lsb>5</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>USART3_CLK_EN</name>
							<description>desc USART3_CLK_EN</description>
							<msb>6</msb>
							<lsb>6</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>USART4_CLK_EN</name>
							<description>desc USART4_CLK_EN</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>LCD_CLK_EN</name>
							<description>desc LCD_CLK_EN</description>
							<msb>8</msb>
							<lsb>8</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>TIM14_CLK_EN</name>
							<description>desc TIM14_CLK_EN</description>
							<msb>9</msb>
							<lsb>9</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>TIM15_CLK_EN</name>
							<description>desc TIM15_CLK_EN</description>
							<msb>10</msb>
							<lsb>10</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>TIM17_CLK_EN</name>
							<description>desc TIM17_CLK_EN</description>
							<msb>11</msb>
							<lsb>11</lsb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WRPR</name>
					<description>desc WRPR</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>WRP</name>
							<description>desc WRP</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STCR</name>
					<description>desc STCR</description>
					<addressOffset>0x90</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00006400</resetValue>
					<fields>
						<field>
							<name>SLEEP_EN</name>
							<description>desc SLEEP_EN</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>SLEEP_TIME</name>
							<description>desc SLEEP_TIME</description>
							<msb>15</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TS0</name>
					<description>desc TS0</description>
					<addressOffset>0x100</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xB4</resetValue>
					<fields>
						<field>
							<name>TS0</name>
							<description>desc TS0</description>
							<msb>7</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TS1</name>
					<description>desc TS1</description>
					<addressOffset>0x104</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1B0</resetValue>
					<fields>
						<field>
							<name>TS1</name>
							<description>desc TS1</description>
							<msb>8</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TS2P</name>
					<description>desc TS2P</description>
					<addressOffset>0x108</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xB4</resetValue>
					<fields>
						<field>
							<name>TS2P</name>
							<description>desc TS2P</description>
							<msb>7</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TPS3</name>
					<description>desc TPS3</description>
					<addressOffset>0x10C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x6C0</resetValue>
					<fields>
						<field>
							<name>TPS3</name>
							<description>desc TPS3</description>
							<msb>10</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TS3</name>
					<description>desc TS3</description>
					<addressOffset>0x110</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xB4</resetValue>
					<fields>
						<field>
							<name>TS3</name>
							<description>desc TS3</description>
							<msb>7</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PERTPE</name>
					<description>desc PERTPE</description>
					<addressOffset>0x114</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xEA60</resetValue>
					<fields>
						<field>
							<name>PERTPE</name>
							<description>desc PERTPE</description>
							<msb>16</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SMERTPE</name>
					<description>desc SMERTPE</description>
					<addressOffset>0x118</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xFD20</resetValue>
					<fields>
						<field>
							<name>SMERTPE</name>
							<description>desc SMERTPE</description>
							<msb>16</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PRGTPE</name>
					<description>desc PRGTPE</description>
					<addressOffset>0x11C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x8CA0</resetValue>
					<fields>
						<field>
							<name>PRGTPE</name>
							<description>desc PRGTPE</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PRETPE</name>
					<description>desc PRETPE</description>
					<addressOffset>0x120</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x12C0</resetValue>
					<fields>
						<field>
							<name>PRETPE</name>
							<description>desc PRETPE</description>
							<msb>13</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRMLSR</name>
					<description>desc TRMLSR</description>
					<addressOffset>0x290</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>PMU_TRIM0_ERR</name>
							<description>desc PMU_TRIM0_ERR</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>PMU_TRIM1_ERR</name>
							<description>desc PMU_TRIM1_ERR</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSI_TRIM_ERR</name>
							<description>desc HSI_TRIM_ERR</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>LSI_TRIM_ERR</name>
							<description>desc LSI_TRIM_ERR</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>FLASH_TRIM0_ERR</name>
							<description>desc FLASH_TRIM0_ERR</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>FLASH_TRIM1_ERR</name>
							<description>desc FLASH_TRIM1_ERR</description>
							<msb>5</msb>
							<lsb>5</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>FLASH_TRIM2_ERR</name>
							<description>desc FLASH_TRIM2_ERR</description>
							<msb>6</msb>
							<lsb>6</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>FLASH_TRIM3_ERR</name>
							<description>desc FLASH_TRIM3_ERR</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>FLASH_TRIM4_ERR</name>
							<description>desc FLASH_TRIM4_ERR</description>
							<msb>8</msb>
							<lsb>8</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>FLASH_TRIM5_ERR</name>
							<description>desc FLASH_TRIM5_ERR</description>
							<msb>9</msb>
							<lsb>9</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>TS_TRIM_ERR</name>
							<description>desc TS_TRIM_ERR</description>
							<msb>10</msb>
							<lsb>10</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>CHIP_CFG_ERR</name>
							<description>desc CHIP_CFG_ERR</description>
							<msb>11</msb>
							<lsb>11</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>CHKRD0_PASS</name>
							<description>desc CHKRD0_PASS</description>
							<msb>16</msb>
							<lsb>16</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>CHKRD1_PASS</name>
							<description>desc CHKRD1_PASS</description>
							<msb>17</msb>
							<lsb>17</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>CHKRD2_PASS</name>
							<description>desc CHKRD2_PASS</description>
							<msb>18</msb>
							<lsb>18</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>CHKRD3_PASS</name>
							<description>desc CHKRD3_PASS</description>
							<msb>19</msb>
							<lsb>19</lsb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRMDR0</name>
					<description>desc TRMDR0</description>
					<addressOffset>0x294</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>BIAS_CR</name>
							<description>desc BIAS_CR</description>
							<msb>3</msb>
							<lsb>0</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRIM_MR</name>
							<description>desc TRIM_MR</description>
							<msb>8</msb>
							<lsb>4</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRIM_VREF</name>
							<description>desc TRIM_VREF</description>
							<msb>13</msb>
							<lsb>9</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRIM_POR</name>
							<description>desc TRIM_POR</description>
							<msb>19</msb>
							<lsb>16</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRIM_BG</name>
							<description>desc TRIM_BG</description>
							<msb>27</msb>
							<lsb>20</lsb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRMDR1</name>
					<description>desc TRMDR1</description>
					<addressOffset>0x298</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>LSI_TRIM</name>
							<description>desc LSI_TRIM</description>
							<msb>8</msb>
							<lsb>0</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSI_TRIM</name>
							<description>desc HSI_TRIM</description>
							<msb>28</msb>
							<lsb>16</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSI_FS</name>
							<description>desc HSI_FS</description>
							<msb>31</msb>
							<lsb>29</lsb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRMDR2</name>
					<description>desc TRMDR2</description>
					<addressOffset>0x29C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>FLASH_OP</name>
							<description>desc FLASH_OP</description>
							<msb>31</msb>
							<lsb>0</lsb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRMDR3</name>
					<description>desc TRMDR3</description>
					<addressOffset>0x2A0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>FLASH_OP</name>
							<description>desc FLASH_OP</description>
							<msb>31</msb>
							<lsb>0</lsb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRMDR4</name>
					<description>desc TRMDR4</description>
					<addressOffset>0x2A4</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>FLASH_ERASE_VPOS</name>
							<description>desc FLASH_ERASE_VPOS</description>
							<msb>4</msb>
							<lsb>0</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>FLASH_ERASE_VNEG</name>
							<description>desc FLASH_ERASE_VNEG</description>
							<msb>9</msb>
							<lsb>5</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>FLASH_PROG_VPOS</name>
							<description>desc FLASH_PROG_VPOS</description>
							<msb>20</msb>
							<lsb>16</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>FLASH_PROG_VNEG</name>
							<description>desc FLASH_PROG_VNEG</description>
							<msb>25</msb>
							<lsb>21</lsb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
