IOsetting/py32f0-template/Misc/py32f072xx.svd
				<register>
					<name>TRMDR5</name>
					<description>desc TRMDR5</description>
					<addressOffset>0x2A8</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>FLASH_SIZE</name>
							<description>desc FLASH_SIZE</description>
							<msb>2</msb>
							<lsb>0</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>SRAM_SIZE</name>
							<description>desc SRAM_SIZE</description>
							<msb>6</msb>
							<lsb>4</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>TS_TRIM</name>
							<description>desc TS_TRIM</description>
							<msb>11</msb>
							<lsb>8</lsb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRMDR6</name>
					<description>desc TRMDR6</description>
					<addressOffset>0x2AC</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>OPA0_TRIM</name>
							<description>desc OPA0_TRIM</description>
							<msb>3</msb>
							<lsb>0</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>OPA1_TRIM</name>
							<description>desc OPA1_TRIM</description>
							<msb>7</msb>
							<lsb>4</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>OPA2_TRIM</name>
							<description>desc OPA2_TRIM</description>
							<msb>11</msb>
							<lsb>8</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>OPA3_TRIM</name>
							<description>desc OPA3_TRIM</description>
							<msb>15</msb>
							<lsb>12</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>OPA4_TRIM</name>
							<description>desc OPA4_TRIM</description>
							<msb>19</msb>
							<lsb>16</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>LCD_TRIM</name>
							<description>desc LCD_TRIM</description>
							<msb>27</msb>
							<lsb>20</lsb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRMDR7</name>
					<description>desc TRMDR7</description>
					<addressOffset>0x2B0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>TS_DATA_0_TRIM</name>
							<description>desc TS_DATA_0_TRIM</description>
							<msb>11</msb>
							<lsb>0</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>TS_DATA_1_TRIM</name>
							<description>desc TS_DATA_1_TRIM</description>
							<msb>23</msb>
							<lsb>12</lsb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRMDR8</name>
					<description>desc TRMDR8</description>
					<addressOffset>0x2B4</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>DAC_0_TRIM</name>
							<description>desc DAC_0_TRIM</description>
							<msb>11</msb>
							<lsb>0</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>DAC_1_TRIM</name>
							<description>desc DAC_1_TRIM</description>
							<msb>23</msb>
							<lsb>12</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>VREF_BUF_TRIM</name>
							<description>desc VREF_BUF_TRIM</description>
							<msb>28</msb>
							<lsb>24</lsb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>GPIOA</name>
			<description>General-purpose I/Os</description>
			<groupName>GPIO</groupName>
			<baseAddress>0x50000000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>MODER</name>
					<displayName>MODER</displayName>
					<description>GPIO port mode register</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xEBFFFFFF</resetValue>
					<fields>
						<field>
							<name>MODE15</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE14</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE13</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE12</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE11</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE10</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE9</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE8</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE7</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE6</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE5</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE4</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE3</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE2</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE1</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE0</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTYPER</name>
					<displayName>OTYPER</displayName>
					<description>GPIO port output type register</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>OT15</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OT14</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OT13</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OT12</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OT11</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OT10</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OT9</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OT8</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OT7</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OT6</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OT5</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OT4</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OT3</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OT2</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OT1</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OT0</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OSPEEDR</name>
					<displayName>OSPEEDR</displayName>
					<description>
						GPIO port output speed
						register
					</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0C000000</resetValue>
					<fields>
						<field>
							<name>OSPEED15</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>OSPEED14</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>OSPEED13</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>OSPEED12</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>OSPEED11</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>OSPEED10</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>OSPEED9</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>OSPEED8</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>OSPEED7</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>OSPEED6</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>OSPEED5</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>OSPEED4</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>OSPEED3</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>OSPEED2</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>OSPEED1</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>OSPEED0</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>PUPDR</name>
					<displayName>PUPDR</displayName>
					<description>
						GPIO port pull-up/pull-down
						register
					</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x24000000</resetValue>
					<fields>
						<field>
							<name>PUPD15</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PUPD14</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PUPD13</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PUPD12</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PUPD11</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PUPD10</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PUPD9</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PUPD8</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PUPD7</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PUPD6</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PUPD5</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PUPD4</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PUPD3</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PUPD2</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PUPD1</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PUPD0</name>
							<description>
								Port x configuration bits (y=0-15)
							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IDR</name>
					<displayName>IDR</displayName>
					<description>GPIO port input data register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ID15</name>
							<description>
								Port input data (y=0-15)
							</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ID14</name>
							<description>
								Port input data (y=0-15)
							</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ID13</name>
							<description>
								Port input data (y=0-15)
							</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ID12</name>
							<description>
								Port input data (y=0-15)
							</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ID11</name>
							<description>
								Port input data (y=0-15)
							</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ID10</name>
							<description>
								Port input data (y=0-15)
							</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ID9</name>
							<description>
								Port input data (y=0-15)
							</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ID8</name>
							<description>
								Port input data (y=0-15)
							</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ID7</name>
							<description>
								Port input data (y=0-15)
							</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ID6</name>
							<description>
								Port input data (y=0-15)
							</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ID5</name>
							<description>
								Port input data (y=0-15)
							</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ID4</name>
							<description>
								Port input data (y=0-15)
							</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ID3</name>
							<description>
								Port input data (y=0-15)
							</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ID2</name>
							<description>
								Port input data (y=0-15)
							</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ID1</name>
							<description>
								Port input data (y=0-15)
							</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ID0</name>
							<description>
								Port input data (y=0-15)
							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
