IOsetting/py32f0-template/Misc/py32f072xx.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="GPIOA">
			<name>GPIOB</name>
			<description>General-purpose I/Os</description>
			<groupName>GPIO</groupName>
			<baseAddress>0x50000400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="GPIOA">
			<name>GPIOC</name>
			<description>General-purpose I/Os</description>
			<groupName>GPIO</groupName>
			<baseAddress>0x50000800</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="GPIOA">
			<name>GPIOF</name>
			<description>General-purpose I/Os</description>
			<groupName>GPIO</groupName>
			<baseAddress>0x50001400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral>
			<name>I2C1</name>
			<description>Inter integrated circuit</description>
			<groupName>I2C</groupName>
			<baseAddress>0x40005400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>I2C1</name>
				<description>I2C1 global Interrupt</description>
				<value>23</value>
			</interrupt>
			<registers>
				<register>
					<name>CR1</name>
					<description>desc CR1</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>PE</name>
							<description>desc PE</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>SMBUS</name>
							<description>desc SMBUS</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>SMBTYPE</name>
							<description>desc SMBTYPE</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENARP</name>
							<description>desc ENARP</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENPEC</name>
							<description>desc ENPEC</description>
							<msb>5</msb>
							<lsb>5</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENGC</name>
							<description>desc ENGC</description>
							<msb>6</msb>
							<lsb>6</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>NOSTRETCH</name>
							<description>desc NOSTRETCH</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>START</name>
							<description>desc START</description>
							<msb>8</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>STOP</name>
							<description>desc STOP</description>
							<msb>9</msb>
							<lsb>9</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ACK</name>
							<description>desc ACK</description>
							<msb>10</msb>
							<lsb>10</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>POS</name>
							<description>desc POS</description>
							<msb>11</msb>
							<lsb>11</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PEC</name>
							<description>desc PEC</description>
							<msb>12</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ALERT</name>
							<description>desc ALERT</description>
							<msb>13</msb>
							<lsb>13</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>SWRST</name>
							<description>desc SWRST</description>
							<msb>15</msb>
							<lsb>15</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CR2</name>
					<description>desc CR2</description>
					<addressOffset>0x4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>FREQ</name>
							<description>desc FREQ</description>
							<msb>5</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ITERREN</name>
							<description>desc ITERREN</description>
							<msb>8</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ITEVTEN</name>
							<description>desc ITEVTEN</description>
							<msb>9</msb>
							<lsb>9</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ITBUFEN</name>
							<description>desc ITBUFEN</description>
							<msb>10</msb>
							<lsb>10</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>DMAEN</name>
							<description>desc DMAEN</description>
							<msb>11</msb>
							<lsb>11</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>LAST</name>
							<description>desc LAST</description>
							<msb>12</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OAR1</name>
					<description>desc OAR1</description>
					<addressOffset>0x8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>ADD0</name>
							<description>desc ADD0</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ADD1_7</name>
							<description>desc ADD1_7</description>
							<msb>7</msb>
							<lsb>1</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ADD8_9</name>
							<description>desc ADD8_9</description>
							<msb>9</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ADDMODE</name>
							<description>desc ADDMODE</description>
							<msb>15</msb>
							<lsb>15</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OAR2</name>
					<description>desc OAR2</description>
					<addressOffset>0xC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>ENDUAL</name>
							<description>desc ENDUAL</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ADD2</name>
							<description>desc ADD2</description>
							<msb>7</msb>
							<lsb>1</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DR</name>
					<description>desc DR</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>DR</name>
							<description>desc DR</description>
							<msb>7</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SR1</name>
					<description>desc SR1</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>SB</name>
							<description>desc SB</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>ADDR</name>
							<description>desc ADDR</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>BTF</name>
							<description>desc BTF</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>ADD10</name>
							<description>desc ADD10</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>STOPF</name>
							<description>desc STOPF</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXNE</name>
							<description>desc RXNE</description>
							<msb>6</msb>
							<lsb>6</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXE</name>
							<description>desc TXE</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>BERR</name>
							<description>desc BERR</description>
							<msb>8</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ARLO</name>
							<description>desc ARLO</description>
							<msb>9</msb>
							<lsb>9</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>AF</name>
							<description>desc AF</description>
							<msb>10</msb>
							<lsb>10</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OVR</name>
							<description>desc OVR</description>
							<msb>11</msb>
							<lsb>11</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PECERR</name>
							<description>desc PECERR</description>
							<msb>12</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIMEOUT</name>
							<description>desc TIMEOUT</description>
							<msb>14</msb>
							<lsb>14</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>SMBALERT</name>
							<description>desc SMBALERT</description>
							<msb>15</msb>
							<lsb>15</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SR2</name>
					<description>desc SR2</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>MSL</name>
							<description>desc MSL</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>BUSY</name>
							<description>desc BUSY</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRA</name>
							<description>desc TRA</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>GENCALL</name>
							<description>desc GENCALL</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>SMBDEFAULT</name>
							<description>desc SMBDEFAULT</description>
							<msb>5</msb>
							<lsb>5</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>SMBHOST</name>
							<description>desc SMBHOST</description>
							<msb>6</msb>
							<lsb>6</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>DUALF</name>
							<description>desc DUALF</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>PEC</name>
							<description>desc PEC</description>
							<msb>15</msb>
							<lsb>8</lsb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR</name>
					<description>desc CCR</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>CCR</name>
							<description>desc CCR</description>
							<msb>11</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>DUTY</name>
							<description>desc DUTY</description>
							<msb>14</msb>
							<lsb>14</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>FS</name>
							<description>desc FS</description>
							<msb>15</msb>
							<lsb>15</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRISE</name>
					<description>desc TRISE</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x2</resetValue>
					
					<fields>
						<field>
							<name>TRISE</name>
							<description>desc TRISE</description>
							<msb>5</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
