IOsetting/py32f0-template/Misc/py32f072xx.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="I2C1">
			<name>I2C2</name>
			<description>desc I2C</description>
			<groupName>I2C</groupName>
			<baseAddress>0x40005800</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>I2C2</name>
				<description>I2C2 Event Interrupt</description>
				<value>24</value>
			</interrupt>
		</peripheral>
		<peripheral>
			<name>IWDG</name>
			<description>Independent watchdog</description>
			<groupName>IWDG</groupName>
			<baseAddress>0x40003000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>KR</name>
					<displayName>KR</displayName>
					<description>Key register (IWDG_KR)</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>KEY</name>
							<description>Key value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>PR</name>
					<displayName>PR</displayName>
					<description>Prescaler register (IWDG_PR)</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PR</name>
							<description>Prescaler divider</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RLR</name>
					<displayName>RLR</displayName>
					<description>Reload register (IWDG_RLR)</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000FFF</resetValue>
					<fields>
						<field>
							<name>RL</name>
							<description>
								Watchdog counter reload
								value
							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SR</name>
					<displayName>SR</displayName>
					<description>Status register (IWDG_SR)</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RVU</name>
							<description>
								Watchdog counter reload value
								update
							</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PVU</name>
							<description>
								Watchdog prescaler value
								update
							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>LCD</name>
			<description>LCD CONTROLLER</description>
			<groupName>LCD</groupName>
			<baseAddress>0x40002400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>LCD</name>
				<description>LCD global Interrupt</description>
				<value>8</value>
			</interrupt>
			<registers>
				<register>
					<name>CR0</name>
					<displayName>CR0</displayName>
					<description>Control register </description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>EN</name>
							<description>EN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCDCLK</name>
							<description>LCDCLK</description>
							<bitOffset>1</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>BIAS</name>
							<description>BIAS</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DUTY</name>
							<description>DUTY</description>
							<bitOffset>7</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>BSEL</name>
							<description>BSEL</description>
							<bitOffset>10</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>CONTRAST</name>
							<description>CONTRAST</description>
							<bitOffset>13</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CR1</name>
					<displayName>CR1</displayName>
					<description>CR1</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>BLINKCNT</name>
							<description>BLINKCNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>BLINKEN</name>
							<description>BLINKEN</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MODE</name>
							<description>MODE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IE</name>
							<description>IE</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>INTF</name>
							<description>INTF</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>INTCLR</name>
					<displayName>INTCLR</displayName>
					<description>INTCLR</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>INTF_CLR</name>
							<description>INTF_CLR</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>POEN0</name>
					<displayName>POEN0</displayName>
					<description>POEN0</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>S0</name>
							<description>S0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S1</name>
							<description>S1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S2</name>
							<description>S2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S3</name>
							<description>S3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S4</name>
							<description>S4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S5</name>
							<description>S5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S6</name>
							<description>S6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S7</name>
							<description>S7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S8</name>
							<description>S8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S9</name>
							<description>S9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S10</name>
							<description>S10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S11</name>
							<description>S11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S12</name>
							<description>S12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S13</name>
							<description>S13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S14</name>
							<description>S14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S15</name>
							<description>S15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S16</name>
							<description>S16</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S17</name>
							<description>S17</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S18</name>
							<description>S18</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S19</name>
							<description>S19</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S20</name>
							<description>S20</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S21</name>
							<description>S21</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S22</name>
							<description>S22</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S23</name>
							<description>S23</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S24</name>
							<description>S24</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S25</name>
							<description>S25</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S26</name>
							<description>S26</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S27</name>
							<description>S27</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S28</name>
							<description>S28</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S29</name>
							<description>S29</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S30</name>
							<description>S30</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S31</name>
							<description>S31</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>POEN1</name>
					<displayName>POEN1</displayName>
					<description>POEN1</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>S32</name>
							<description>S32</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S33</name>
							<description>S33</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S34</name>
							<description>S34</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S35</name>
							<description>S35</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S36</name>
							<description>S36</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S37</name>
							<description>S37</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S38</name>
							<description>S38</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>S39</name>
							<description>S39</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>C0</name>
							<description>C0</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>C1</name>
							<description>C1</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>C2</name>
							<description>C2</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>C3</name>
							<description>C3</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MUX</name>
							<description>MUX</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM0</name>
					<displayName>RAM0</displayName>
					<description>des RAM0</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>D</name>
							<description>des D</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM1</name>
					<displayName>RAM1</displayName>
					<description>des RAM1</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>D</name>
							<description>des D</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM2</name>
					<displayName>RAM2</displayName>
					<description>des RAM2</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>D</name>
							<description>des D</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM3</name>
					<displayName>RAM3</displayName>
					<description>des RAM3</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>D</name>
							<description>des D</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM4</name>
					<displayName>RAM4</displayName>
					<description>des RAM4</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>D</name>
							<description>des D</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM5</name>
					<displayName>RAM5</displayName>
					<description>des RAM5</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>D</name>
							<description>des D</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM6</name>
					<displayName>RAM6</displayName>
					<description>des RAM6</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>D</name>
							<description>des D</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM7</name>
					<displayName>RAM7</displayName>
					<description>des RAM7</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>D</name>
							<description>des D</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM8</name>
					<displayName>RAM8</displayName>
					<description>des RAM8</description>
					<addressOffset>0x34</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>D</name>
							<description>des D</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM9</name>
					<displayName>RAM9</displayName>
					<description>des RAM9</description>
					<addressOffset>0x38</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>D</name>
							<description>des D</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM10</name>
					<displayName>RAM10</displayName>
					<description>des RAM10</description>
					<addressOffset>0x3C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>D</name>
							<description>des D</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM11</name>
					<displayName>RAM11</displayName>
					<description>des RAM11</description>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>D</name>
							<description>des D</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM12</name>
					<displayName>RAM12</displayName>
					<description>des RAM12</description>
					<addressOffset>0x44</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>D</name>
							<description>des D</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM13</name>
					<displayName>RAM13</displayName>
					<description>des RAM13</description>
					<addressOffset>0x48</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>D</name>
							<description>des D</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM14</name>
					<displayName>RAM14</displayName>
					<description>des RAM14</description>
					<addressOffset>0x4C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>D</name>
							<description>des D</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM15</name>
					<displayName>RAM15</displayName>
					<description>des RAM15</description>
					<addressOffset>0x50</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>D</name>
							<description>des D</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
