IOsetting/py32f0-template/Misc/py32f072xx.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>LPTIM1</name>
			<description>Low power timer</description>
			<groupName>LPTIM1</groupName>
			<baseAddress>0x40007C00</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>TIM6_LPTIM1_DAC</name>
				<description>TIM6, LPTIM1, DAC global Interrupts</description>
				<value>17</value>
			</interrupt>
			<registers>
				<register>
					<name>ISR</name>
					<displayName>ISR</displayName>
					<description>Interrupt and Status Register</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ARRM</name>
							<description>Autoreload match</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ARROK</name>
							<description>Autoreload match update OK</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ICR</name>
					<displayName>ICR</displayName>
					<description>Interrupt Clear Register</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ARRMCF</name>
							<description>
								Autoreload match Clear
								Flag
							</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ARROKCF</name>
							<description>
								Autoreload match update OK
								Clear Flag
							</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IER</name>
					<displayName>IER</displayName>
					<description>Interrupt Enable Register</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ARRMIE</name>
							<description>
								Autoreload matchInterrupt
								Enable
							</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ARROKIE</name>
							<description>
								Autoreload match update 
								OK Interrupt Enable
							</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CFGR</name>
					<displayName>CFGR</displayName>
					<description>Configuration Register</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PRELOAD</name>
							<description>Registers update mode</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PRESC</name>
							<description>Clock prescaler</description>
							<bitOffset>9</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>Control Register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RSTARE</name>
							<description>Reset after read enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CNTSTRT</name>
							<description>CNTSTRT</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SNGSTRT</name>
							<description>LPTIM start in single mode</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ENABLE</name>
							<description>LPTIM Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ARR</name>
					<displayName>ARR</displayName>
					<description>Autoreload Register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000001</resetValue>
					<fields>
						<field>
							<name>ARR</name>
							<description>Auto reload value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CNT</name>
					<displayName>CNT</displayName>
					<description>Counter Register</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CNT</name>
							<description>Counter value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>OPA</name>
			<description>des OPA</description>
			<groupName>OPA</groupName>
			<baseAddress>0x40010300</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CR0</name>
					<displayName>CR0</displayName>
					<description>CR0 register</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFFFFFFFF</resetValue>
					<fields>
						<field>
							<name>OP1OEN1</name>
							<description>OP1OEN1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OP2OEN1</name>
							<description>OP2OEN1</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OP3OEN1</name>
							<description>OP3OEN1</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CR1</name>
					<displayName>CR1</displayName>
					<description>CR1 register</description>
					<addressOffset>0x34</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EN1</name>
							<description>EN1</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EN2</name>
							<description>EN2</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EN3</name>
							<description>EN3</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
