IOsetting/py32f0-template/Misc/py32f072xx.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>PWR</name>
			<description>Power control</description>
			<groupName>PWR</groupName>
			<baseAddress>0x40007000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CR1</name>
					<displayName>CR1</displayName>
					<description>Power control register 1</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00030000</resetValue>
					<fields>
						<field>
							<name>HSION_CTRL</name>
							<description>HSI open time control</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SRAM_RETV</name>
							<description>SRAM retention voltage control</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>LPR</name>
							<description>Low-power run</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FLS_SLPTIME</name>
							<description>Flash wait time after wakeup from the stop mode</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>VOS</name>
							<description>
								Voltage scaling range
								selection
							</description>
							<bitOffset>9</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>DBP</name>
							<description>
								Disable backup domain write
								protection
							</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BIAS_CR_SEL</name>
							<description>MR Bias current selection</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BIAS_CR</name>
							<description>MR Bias current</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CR2</name>
					<displayName>CR2</displayName>
					<description>Power control register 2</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000500</resetValue>
					<fields>
						<field>
							<name>FLT_TIME</name>
							<description>Digital filter time configuration</description>
							<bitOffset>9</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>FLTEN</name>
							<description>Digital filter enable </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PVDT</name>
							<description>
								Power voltage detector  threshold
								selection
							</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SRCSEL</name>
							<description>
								Power voltage detector volatage
								selection
							</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PVDE</name>
							<description>
								Power voltage detector
								enable
							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SR</name>
					<displayName>SR</displayName>
					<description>Power status register </description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PVDO</name>
							<description>PVD output</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>RCC</name>
			<description>Reset and clock control</description>
			<groupName>RCC</groupName>
			<baseAddress>0x40021000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>RCC_CTC</name>
				<description>RCC and CTC global Interrupts</description>
				<value>4</value>
			</interrupt>
			<registers>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>Clock control register</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000100</resetValue>
					<fields>
						<field>
							<name>PLLRDY</name>
							<description>PLL clock ready flag</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PLLON</name>
							<description>PLL enable</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADC_DIV</name>
							<description>ADC Frequency Division</description>
							<bitOffset>21</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CSSON</name>
							<description>
								Clock security system
								enable
							</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSEBYP</name>
							<description>
								HSE crystal oscillator
								bypass
							</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSERDY</name>
							<description>HSE clock ready flag</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSEON</name>
							<description>HSE clock enable</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSIDIV</name>
							<description>
								HSI16 clock division
								factor
							</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>HSIRDY</name>
							<description>HSI16 clock ready flag</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSION</name>
							<description>HSI16 clock enable</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ICSCR</name>
					<displayName>ICSCR</displayName>
					<description>
						Internal clock sources calibration
						register
					</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<resetValue>0x10000000</resetValue>
					<fields>
						<field>
							<name>LSI_TRIM</name>
							<description>LSI clock trimming</description>
							<bitOffset>16</bitOffset>
							<bitWidth>9</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HSI_FS</name>
							<description>HSI frequency selection</description>
							<bitOffset>13</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HSI_TRIM</name>
							<description>HSI clock trimming</description>
							<bitOffset>0</bitOffset>
							<bitWidth>13</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CFGR</name>
					<displayName>CFGR</displayName>
					<description>Clock configuration register</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MCOPRE</name>
							<description>
								Microcontroller clock output
								prescaler
							</description>
							<bitOffset>28</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCOSEL</name>
							<description>
								Microcontroller clock
								output
							</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PPRE</name>
							<description>APB prescaler</description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HPRE</name>
							<description>AHB prescaler</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SWS</name>
							<description>System clock switch status</description>
							<bitOffset>3</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SW</name>
							<description>System clock switch</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PLLCFGR</name>
					<displayName>PLLCFGR</displayName>
					<description>PLL configuration register</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PLLSRC</name>
							<description>PLL clock source selection</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PLLMUL</name>
							<description>PLLMUL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ECSCR</name>
					<displayName>ECSCR</displayName>
					<description>External clock source control register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>HSE_DRV</name>
							<description>HSE_DRV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HSE_STARTUP</name>
							<description>HSE_STARTUP</description>
							<bitOffset>3</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LSE_DRIVER</name>
							<description>LSE clock driver selection</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LSE_STARTUP</name>
							<description>LSE_STARTUP</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CIER</name>
					<displayName>CIER</displayName>
					<description>
						Clock interrupt enable
						register
					</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PLLRDYIE</name>
							<description>PLL ready interrupt enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSERDYIE</name>
							<description>HSE ready interrupt enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSIRDYIE</name>
							<description>HSI ready interrupt enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LSERDYIE</name>
							<description>LSE ready interrupt enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LSIRDYIE</name>
							<description>LSI ready interrupt enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CIFR</name>
					<displayName>CIFR</displayName>
					<description>Clock interrupt flag register</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LSECSSF</name>
							<description>LSE clock secure system interrupt flag</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CSSF</name>
							<description>HSE clock secure system interrupt flag</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PLLRDYF</name>
							<description>PLL ready interrupt flag</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSERDYF</name>
							<description>HSE ready interrupt flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSIRDYF</name>
							<description>HSI ready interrupt flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LSERDYF</name>
							<description>LSE ready interrupt flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LSIRDYF</name>
							<description>LSI ready interrupt flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CICR</name>
					<displayName>CICR</displayName>
					<description>Clock interrupt clear register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LSECSSC</name>
							<description>LSE clock secure system interrupt flag clear</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CSSC</name>
							<description>clock secure system interrupt flag clear</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PLLRDYC</name>
							<description>PLL ready interrupt clear</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSERDYC</name>
							<description>HSE ready interrupt clear</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSIRDYC</name>
							<description>HSI ready interrupt clear</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LSERDYC</name>
							<description>LSE ready interrupt clear</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LSIRDYC</name>
							<description>LSI ready interrupt clear</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IOPRSTR</name>
					<displayName>IOPRSTR</displayName>
					<description>GPIO reset register</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>GPIOFRST</name>
							<description>I/O port F reset</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOCRST</name>
							<description>I/O port F reset</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOBRST</name>
							<description>I/O port B reset</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOARST</name>
							<description>I/O port A reset</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>AHBRSTR</name>
					<displayName>AHBRSTR</displayName>
					<description>AHB peripheral reset register</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DIVRST</name>
							<description>DIV reset</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CRCRST</name>
							<description>CRC reset</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMARST</name>
							<description>DMA reset</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>APBRSTR1</name>
					<displayName>APBRSTR1</displayName>
					<description>
						APB peripheral reset register
						1
					</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LPTIMRST</name>
							<description>Low Power Timer reset</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OPARST</name>
							<description>OPARST</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DACRST</name>
							<description>DACRST</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PWRRST</name>
							<description>Power interface reset</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CTCRST</name>
							<description>CTCRST</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CANRST</name>
							<description>CANRST</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USBRST</name>
							<description>USB reset</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C2RST</name>
							<description>I2C2 reset</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C1RST</name>
							<description>I2C1 reset</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART4RST</name>
							<description>USART4 reset</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART3RST</name>
							<description>USART3 reset</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART2RST</name>
							<description>USART2 reset</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI2RST</name>
							<description>SPI2 reset</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WWDGRST</name>
							<description>WWDG reset</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RTCAPBRST</name>
							<description>RTCAPB reset</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM7RST</name>
							<description>TIM7 timer reset</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM6RST</name>
							<description>TIM6 timer reset</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM3RST</name>
							<description>TIM3 timer reset</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM2RST</name>
							<description>TIM2 timer reset</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
