IOsetting/py32f0-template/Misc/py32f072xx.svd
				<register>
					<name>APBRSTR2</name>
					<displayName>APBRSTR2</displayName>
					<description>
						APB peripheral reset register
						2
					</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SYSCFGRST</name>
							<description>SYSCFG reset</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADCRST</name>
							<description>ADC reset</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBGRST</name>
							<description>DBG reset</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM1RST</name>
							<description>TIM1 reset</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI1RST</name>
							<description>SPI1 reset</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART1RST</name>
							<description>USART1 reset</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM14RST</name>
							<description>TIM14 reset</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM15RST</name>
							<description>TIM15 reset</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM16RST</name>
							<description>TIM16 reset</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM17RST</name>
							<description>TIM17 reset</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>COMP1RST</name>
							<description>COMP1 reset</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>COMP2RST</name>
							<description>COMP2 reset</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>COMP3RST</name>
							<description>COMP3 reset</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCDRST</name>
							<description>LCD reset</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IOPENR</name>
					<displayName>IOPENR</displayName>
					<description>GPIO clock enable register</description>
					<addressOffset>0x34</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>GPIOFEN</name>
							<description>I/O port F clock enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOCEN</name>
							<description>I/O port C clock enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOBEN</name>
							<description>I/O port B clock enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOAEN</name>
							<description>I/O port A clock enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>AHBENR</name>
					<displayName>AHBENR</displayName>
					<description>
						AHB peripheral clock enable
						register
					</description>
					<addressOffset>0x38</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DIVEN</name>
							<description>DIVEN</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CRCEN</name>
							<description>CRC clock enable</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SRAMEN</name>
							<description>
								SRAM memory interface clock
								enable
							</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FLASHEN</name>
							<description>
								Flash memory interface clock
								enable
							</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMAEN</name>
							<description>DMA clock enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>APBENR1</name>
					<displayName>APBENR1</displayName>
					<description>
						APB peripheral clock enable register
						1
					</description>
					<addressOffset>0x3C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LPTIMEN</name>
							<description>LPTIM clock enable</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>

						<field>
							<name>OPAEN</name>
							<description>OPA clock enable</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DACEN</name>
							<description>DAC clock enable</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PWREN</name>
							<description>
								Power interface clock
								enable
							</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CTCEN</name>
							<description>CTC clock enable</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CANEN</name>
							<description>CAN clock enable</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USBEN</name>
							<description>USB clock enable</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C2EN</name>
							<description>I2C2 clock enable</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C1EN</name>
							<description>I2C1 clock enable</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART4EN</name>
							<description>USART4 clock enable</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART3EN</name>
							<description>USART3 clock enable</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART2EN</name>
							<description>USART2 clock enable</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI2EN</name>
							<description>SPI2 clock enable</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WWDGEN</name>
							<description>WWDG clock enable</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RTCAPBEN</name>
							<description>RTC APB clock enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM7EN</name>
							<description>TIM7 timer clock enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM6EN</name>
							<description>TIM6 timer clock enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM3EN</name>
							<description>TIM3 timer clock enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM2EN</name>
							<description>TIM2 timer clock enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>APBENR2</name>
					<displayName>APBENR2</displayName>
					<description>
						APB peripheral clock enable register
						2
					</description>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SYSCFGEN</name>
							<description>
								SYSCFG, COMP and VREFBUF clock
								enable
							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADCEN</name>
							<description>ADCEN clock enable</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBGEN</name>
							<description>DBG clock enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM1EN</name>
							<description>TIM1 clock enable</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI1EN</name>
							<description>SPI1 clock enable</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART1EN</name>
							<description>USART1 clock enable</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM14EN</name>
							<description>TIM14 clock enable</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM15EN</name>
							<description>TIM15 clock enable</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM16EN</name>
							<description>TIM16 clock enable</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM17EN</name>
							<description>TIM17 clock enable</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>COMP1EN</name>
							<description>COMP1 clock enable</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>COMP2EN</name>
							<description>COMP2 clock enable</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>COMP3EN</name>
							<description>COMP3 clock enable</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCDEN</name>
							<description>LCD clock enable</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CCIPR</name>
					<displayName>CCIPR</displayName>
					<description>
						Peripherals independent clock configuration
						register
					</description>
					<addressOffset>0x54</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LPTIM1SEL</name>
							<description>
								LPTIM1 clock source
								selection
							</description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>COMP3SEL</name>
							<description>
								COMP3 clock source
								selection
							</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>COMP2SEL</name>
							<description>
								COMP2 clock source
								selection
							</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>COMP1SEL</name>
							<description>
								COMP1 clock source
								selection
							</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PVDSEL</name>
							<description>
								PVD detect clock source
								selection
							</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CANSEL</name>
							<description>
								CAN detect clock source
								selection
							</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>BDCR</name>
					<displayName>BDCR</displayName>
					<description>RTC domain control register</description>
					<addressOffset>0x5C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LSCOSEL</name>
							<description>
								Low-speed clock output
								selection
							</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LSCOEN</name>
							<description>
								Low-speed clock output (LSCO)
								enable
							</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BDRST</name>
							<description>RTC domain software reset</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RTCEN</name>
							<description>RTC clock source enable</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RTCSEL</name>
							<description>RTC clock source selection</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>LSECSSD</name>
							<description>LSE CSS detect</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LSECSSON</name>
							<description>LSE CSS enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LSEBYP</name>
							<description>LSE oscillator bypass</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LSERDY</name>
							<description>LSE oscillator ready</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LSEON</name>
							<description>LSE oscillator enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CSR</name>
					<displayName>CSR</displayName>
					<description>Control/status register</description>
					<addressOffset>0x60</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>WWDGRSTF</name>
							<description>Window watchdog reset flag</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IWDGRSTF</name>
							<description>
								Independent window watchdog reset
								flag
							</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SFTRSTF</name>
							<description>Software reset flag</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PWRRSTF</name>
							<description>BOR or POR/PDR flag</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PINRSTF</name>
							<description>Pin reset flag</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OBLRSTF</name>
							<description>
								Option byte loader reset
								flag
							</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RMVF</name>
							<description>Remove reset flags</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>NRST_FLTDIS</name>
							<description>NRST_FLTDIS oscillator ready</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LSIRDY</name>
							<description>LSI oscillator ready</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LSION</name>
							<description>LSI oscillator enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
