IOsetting/py32f0-template/Misc/py32f072xx.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>RTC</name>
			<description>desc RTC</description>
			<groupName>RTC</groupName>
			<baseAddress>0x40002800</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>RTC</name>
				<description>RTC Interrupt through EXTI Lines 19</description>
				<value>2</value>
			</interrupt>
			<registers>
				<register>
					<name>CRH</name>
					<description>desc CRH</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>SECIE</name>
							<description>desc SECIE</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ALRIE</name>
							<description>desc ALRIE</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OWIE</name>
							<description>desc OWIE</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CRL</name>
					<description>desc CRL</description>
					<addressOffset>0x4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x20</resetValue>
					
					<fields>
						<field>
							<name>SECF</name>
							<description>desc SECF</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ALRF</name>
							<description>desc ALRF</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OWF</name>
							<description>desc OWF</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>RSF</name>
							<description>desc RSF</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CNF</name>
							<description>desc CNF</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>RTOFF</name>
							<description>desc RTOFF</description>
							<msb>5</msb>
							<lsb>5</lsb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PRLH</name>
					<description>desc PRLH</description>
					<addressOffset>0x8</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>PRL</name>
							<description>desc PRL</description>
							<msb>3</msb>
							<lsb>0</lsb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PRLL</name>
					<description>desc PRLL</description>
					<addressOffset>0xC</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x8000</resetValue>
					<fields>
						<field>
							<name>PRL</name>
							<description>desc PRL</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DIVH</name>
					<description>desc DIVH</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>DIV</name>
							<description>desc DIV</description>
							<msb>3</msb>
							<lsb>0</lsb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DIVL</name>
					<description>desc DIVL</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x8000</resetValue>
					<fields>
						<field>
							<name>DIV</name>
							<description>desc DIV</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CNTH</name>
					<description>desc CNTH</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>RTC_CNT</name>
							<description>desc RTC_CNT</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CNTL</name>
					<description>desc CNTL</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>RTC_CNT</name>
							<description>desc RTC_CNT</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ALRH</name>
					<description>desc ALRH</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xFFFF</resetValue>
					<fields>
						<field>
							<name>RTC_ALR</name>
							<description>desc RTC_ALR</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ALRL</name>
					<description>desc ALRL</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xFFFF</resetValue>
					<fields>
						<field>
							<name>RTC_ALR</name>
							<description>desc RTC_ALR</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BKP_RTCCR</name>
					<description>desc BKP_RTCCR</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>CAL</name>
							<description>desc CAL</description>
							<msb>6</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CCO</name>
							<description>desc CCO</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ASOE</name>
							<description>desc ASOE</description>
							<msb>8</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ASOS</name>
							<description>desc ASOS</description>
							<msb>9</msb>
							<lsb>9</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
