IOsetting/py32f0-template/Misc/py32f072xx.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="SPI1">
			<name>SPI2</name>
			<baseAddress>0x40003800</baseAddress>
			<interrupt>
				<name>SPI2</name>
				<description>SPI2 global Interrupt</description>
				<value>26</value>
			</interrupt>
		</peripheral>
		<peripheral>
			<name>SYSCFG</name>
			<description>desc SYSCFG</description>
			<groupName>SYSCFG</groupName>
			<baseAddress>0x40010000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x200</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CFGR1</name>
					<description>desc CFGR1</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xFF0000</resetValue>
					<fields>
						<field>
							<name>MEM_MODE</name>
							<description>desc MEM_MODE</description>
							<msb>1</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIM1_IC1_SRC</name>
							<description>desc TIM1_IC1_SRC</description>
							<msb>3</msb>
							<lsb>2</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIM2_IC4_SRC</name>
							<description>desc TIM2_IC4_SRC</description>
							<msb>5</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIM3_IC1_SRC</name>
							<description>desc TIM3_IC1_SRC</description>
							<msb>7</msb>
							<lsb>6</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETR_SRC_TIM1</name>
							<description>desc ETR_SRC_TIM1</description>
							<msb>10</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETR_SRC_TIM2</name>
							<description>desc ETR_SRC_TIM2</description>
							<msb>14</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETR_SRC_TIM3</name>
							<description>desc ETR_SRC_TIM3</description>
							<msb>18</msb>
							<lsb>16</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>GPIO_AHB_SEL</name>
							<description>desc GPIO_AHB_SEL</description>
							<msb>24</msb>
							<lsb>24</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CFGR2</name>
					<description>desc CFGR2</description>
					<addressOffset>0x4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x4</resetValue>
					<fields>
						<field>
							<name>LOCKUP_LOCK</name>
							<description>desc LOCKUP_LOCK</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PVD_LOCK</name>
							<description>desc PVD_LOCK</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP1_BRK_TIM1</name>
							<description>desc COMP1_BRK_TIM1</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP2_BRK_TIM1</name>
							<description>desc COMP2_BRK_TIM1</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP3_BRK_TIM1</name>
							<description>desc COMP3_BRK_TIM1</description>
							<msb>5</msb>
							<lsb>5</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP1_BRK_TIM15</name>
							<description>desc COMP1_BRK_TIM15</description>
							<msb>6</msb>
							<lsb>6</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP2_BRK_TIM15</name>
							<description>desc COMP2_BRK_TIM15</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP3_BRK_TIM15</name>
							<description>desc COMP3_BRK_TIM15</description>
							<msb>8</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP1_BRK_TIM16</name>
							<description>desc COMP1_BRK_TIM16</description>
							<msb>9</msb>
							<lsb>9</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP2_BRK_TIM16</name>
							<description>desc COMP2_BRK_TIM16</description>
							<msb>10</msb>
							<lsb>10</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP3_BRK_TIM16</name>
							<description>desc COMP3_BRK_TIM16</description>
							<msb>11</msb>
							<lsb>11</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP1_BRK_TIM17</name>
							<description>desc COMP1_BRK_TIM17</description>
							<msb>12</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP2_BRK_TIM17</name>
							<description>desc COMP2_BRK_TIM17</description>
							<msb>13</msb>
							<lsb>13</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP3_BRK_TIM17</name>
							<description>desc COMP3_BRK_TIM17</description>
							<msb>14</msb>
							<lsb>14</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP1_OCREF_CLR_TIM1</name>
							<description>desc COMP1_OCREF_CLR_TIM1</description>
							<msb>15</msb>
							<lsb>15</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP1_OCREF_CLR_TIM2</name>
							<description>desc COMP1_OCREF_CLR_TIM2</description>
							<msb>16</msb>
							<lsb>16</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP1_OCREF_CLR_TIM3</name>
							<description>desc COMP1_OCREF_CLR_TIM3</description>
							<msb>17</msb>
							<lsb>17</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP2_OCREF_CLR_TIM1</name>
							<description>desc COMP2_OCREF_CLR_TIM1</description>
							<msb>18</msb>
							<lsb>18</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP2_OCREF_CLR_TIM2</name>
							<description>desc COMP2_OCREF_CLR_TIM2</description>
							<msb>19</msb>
							<lsb>19</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP2_OCREF_CLR_TIM3</name>
							<description>desc COMP2_OCREF_CLR_TIM3</description>
							<msb>20</msb>
							<lsb>20</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP3_OCREF_CLR_TIM1</name>
							<description>desc COMP3_OCREF_CLR_TIM1</description>
							<msb>21</msb>
							<lsb>21</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP3_OCREF_CLR_TIM2</name>
							<description>desc COMP3_OCREF_CLR_TIM2</description>
							<msb>22</msb>
							<lsb>22</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP3_OCREF_CLR_TIM3</name>
							<description>desc COMP3_OCREF_CLR_TIM3</description>
							<msb>23</msb>
							<lsb>23</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CFGR3</name>
					<description>desc CFGR3</description>
					<addressOffset>0x8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>DMA1_MAP</name>
							<description>desc DMA1_MAP</description>
							<msb>5</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>DMA2_MAP</name>
							<description>desc DMA2_MAP</description>
							<msb>13</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>DMA3_MAP</name>
							<description>desc DMA3_MAP</description>
							<msb>21</msb>
							<lsb>16</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>DMA4_MAP</name>
							<description>desc DMA4_MAP</description>
							<msb>29</msb>
							<lsb>24</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CFGR4</name>
					<description>desc CFGR4</description>
					<addressOffset>0xC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>DMA5_MAP</name>
							<description>desc DMA5_MAP</description>
							<msb>5</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>DMA6_MAP</name>
							<description>desc DMA6_MAP</description>
							<msb>13</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>DMA7_MAP</name>
							<description>desc DMA7_MAP</description>
							<msb>21</msb>
							<lsb>16</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PAENS</name>
					<description>desc PAENS</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>PA_ENS</name>
							<description>desc PA_ENS</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PBENS</name>
					<description>desc PBENS</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>PB_ENS</name>
							<description>desc PB_ENS</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PCENS</name>
					<description>desc PCENS</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>PC_ENS</name>
							<description>desc PC_ENS</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PFENS</name>
					<description>desc PFENS</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>PF_ENS</name>
							<description>desc PF_ENS</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EIIC</name>
					<description>desc EIIC</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>PA_EIIC</name>
							<description>desc PA_EIIC</description>
							<msb>1</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PB_EIIC</name>
							<description>desc PB_EIIC</description>
							<msb>16</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PF_EIIC</name>
							<description>desc PF_EIIC</description>
							<msb>25</msb>
							<lsb>24</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
