IOsetting/py32f0-template/Misc/py32f072xx.svd
				<register>
					<name>CCER</name>
					<description>desc CCER</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0x3333</resetMask>
					<fields>
						<field>
							<name>CC1E</name>
							<description>desc CC1E</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC1P</name>
							<description>desc CC1P</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2E</name>
							<description>desc CC2E</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2P</name>
							<description>desc CC2P</description>
							<msb>5</msb>
							<lsb>5</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC3E</name>
							<description>desc CC3E</description>
							<msb>8</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC3P</name>
							<description>desc CC3P</description>
							<msb>9</msb>
							<lsb>9</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC4E</name>
							<description>desc CC4E</description>
							<msb>12</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC4P</name>
							<description>desc CC4P</description>
							<msb>13</msb>
							<lsb>13</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CNT</name>
					<description>desc CNT</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>CNT</name>
							<description>desc CNT</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PSC</name>
					<description>desc PSC</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>PSC</name>
							<description>desc PSC</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ARR</name>
					<description>desc ARR</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xFFFF</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>ARR</name>
							<description>desc ARR</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR1</name>
					<description>desc CCR1</description>
					<addressOffset>0x34</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>CCR1</name>
							<description>desc CCR1</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR2</name>
					<description>desc CCR2</description>
					<addressOffset>0x38</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>CCR2</name>
							<description>desc CCR2</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR3</name>
					<description>desc CCR3</description>
					<addressOffset>0x3C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>CCR3</name>
							<description>desc CCR3</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR4</name>
					<description>desc CCR4</description>
					<addressOffset>0x40</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>CCR4</name>
							<description>desc CCR4</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DCR</name>
					<description>desc DCR</description>
					<addressOffset>0x48</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0x1F1F</resetMask>
					<fields>
						<field>
							<name>DBA</name>
							<description>desc DBA</description>
							<msb>4</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>DBL</name>
							<description>desc DBL</description>
							<msb>12</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DMAR</name>
					<description>desc DMAR</description>
					<addressOffset>0x4C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>DMAB</name>
							<description>desc DMAB</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
