IOsetting/py32f0-template/Misc/py32f072xx.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>TIM3</name>
			<description>General purpose timer</description>
			<groupName>TIM</groupName>
			<baseAddress>0x40000400</baseAddress>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>TIM3</name>
				<description>TIM3 global Interrupt</description>
				<value>16</value>
			</interrupt>
			<registers>
				<register>
					<name>CR1</name>
					<description>desc CR1</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0x3FF</resetMask>
					<fields>
						<field>
							<name>CEN</name>
							<description>desc CEN</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>UDIS</name>
							<description>desc UDIS</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>URS</name>
							<description>desc URS</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OPM</name>
							<description>desc OPM</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>DIR</name>
							<description>desc DIR</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMS</name>
							<description>desc CMS</description>
							<msb>6</msb>
							<lsb>5</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ARPE</name>
							<description>desc ARPE</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CKD</name>
							<description>desc CKD</description>
							<msb>9</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CR2</name>
					<description>desc CR2</description>
					<addressOffset>0x4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xF8</resetMask>
					<fields>
						<field>
							<name>CCDS</name>
							<description>desc CCDS</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>MMS</name>
							<description>desc MMS</description>
							<msb>6</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TI1S</name>
							<description>desc TI1S</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SMCR</name>
					<description>desc SMCR</description>
					<addressOffset>0x8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFF7</resetMask>
					<fields>
						<field>
							<name>SMS</name>
							<description>desc SMS</description>
							<msb>2</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TS</name>
							<description>desc TS</description>
							<msb>6</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSM</name>
							<description>desc MSM</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETF</name>
							<description>desc ETF</description>
							<msb>11</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETPS</name>
							<description>desc ETPS</description>
							<msb>13</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ECE</name>
							<description>desc ECE</description>
							<msb>14</msb>
							<lsb>14</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETP</name>
							<description>desc ETP</description>
							<msb>15</msb>
							<lsb>15</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DIER</name>
					<description>desc DIER</description>
					<addressOffset>0xC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0x5F5F</resetMask>
					<fields>
						<field>
							<name>UIE</name>
							<description>desc UIE</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC1IE</name>
							<description>desc CC1IE</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2IE</name>
							<description>desc CC2IE</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC3IE</name>
							<description>desc CC3IE</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC4IE</name>
							<description>desc CC4IE</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE</name>
							<description>desc TIE</description>
							<msb>6</msb>
							<lsb>6</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>UDE</name>
							<description>desc UDE</description>
							<msb>8</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC1DE</name>
							<description>desc CC1DE</description>
							<msb>9</msb>
							<lsb>9</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2DE</name>
							<description>desc CC2DE</description>
							<msb>10</msb>
							<lsb>10</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC3DE</name>
							<description>desc CC3DE</description>
							<msb>11</msb>
							<lsb>11</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC4DE</name>
							<description>desc CC4DE</description>
							<msb>12</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TDE</name>
							<description>desc TDE</description>
							<msb>14</msb>
							<lsb>14</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SR</name>
					<description>desc SR</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0x1E5F</resetMask>
					<fields>
						<field>
							<name>UIF</name>
							<description>desc UIF</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC1IF</name>
							<description>desc CC1IF</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2IF</name>
							<description>desc CC2IF</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC3IF</name>
							<description>desc CC3IF</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC4IF</name>
							<description>desc CC4IF</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>COMIF</name>
							<description>desc COMIF</description>
							<msb>5</msb>
							<lsb>5</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIF</name>
							<description>desc TIF</description>
							<msb>6</msb>
							<lsb>6</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>BIF</name>
							<description>desc BIF</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC1OF</name>
							<description>desc CC1OF</description>
							<msb>9</msb>
							<lsb>9</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2OF</name>
							<description>desc CC2OF</description>
							<msb>10</msb>
							<lsb>10</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC3OF</name>
							<description>desc CC3OF</description>
							<msb>11</msb>
							<lsb>11</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC4OF</name>
							<description>desc CC4OF</description>
							<msb>12</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>IC1IR</name>
							<description>desc IC1IR</description>
							<msb>16</msb>
							<lsb>16</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>IC2IR</name>
							<description>desc IC2IR</description>
							<msb>17</msb>
							<lsb>17</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>IC3IR</name>
							<description>desc IC3IR</description>
							<msb>18</msb>
							<lsb>18</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>IC4IR</name>
							<description>desc IC3IR</description>
							<msb>19</msb>
							<lsb>19</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>IC1IF</name>
							<description>desc IC1IF</description>
							<msb>20</msb>
							<lsb>20</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>IC2IF</name>
							<description>desc IC2IF</description>
							<msb>21</msb>
							<lsb>21</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>IC3IF</name>
							<description>desc IC3IF</description>
							<msb>22</msb>
							<lsb>22</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>IC4IF</name>
							<description>desc IC3IF</description>
							<msb>23</msb>
							<lsb>23</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EGR</name>
					<description>desc EGR</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0x5F</resetMask>
					<fields>
						<field>
							<name>UG</name>
							<description>desc UG</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CC1G</name>
							<description>Capture/Compare 1 Generation</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CC2G</name>
							<description>desc CC2G</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CC3G</name>
							<description>desc CC3G</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CC4G</name>
							<description>desc CC4G</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>TG</name>
							<description>desc TG</description>
							<msb>6</msb>
							<lsb>6</lsb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCMR1_OUTPUT</name>
					<description>desc CCMR1:OUTPUT</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>CC1S</name>
							<description>desc CC1S</description>
							<msb>1</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OC1FE</name>
							<description>desc OC1FE</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OC1PE</name>
							<description>desc OC1PE</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OC1M</name>
							<description>desc OC1M</description>
							<msb>6</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OC1CE</name>
							<description>desc OC1CE</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2S</name>
							<description>desc CC2S</description>
							<msb>9</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OC2FE</name>
							<description>desc OC2FE</description>
							<msb>10</msb>
							<lsb>10</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OC2PE</name>
							<description>desc OC2PE</description>
							<msb>11</msb>
							<lsb>11</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OC2M</name>
							<description>desc OC2M</description>
							<msb>14</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OC2CE</name>
							<description>desc OC2CE</description>
							<msb>15</msb>
							<lsb>15</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCMR1_INPUT</name>
					<description>desc CCMR1:INPUT</description>
					<alternateRegister>CCMR1_OUTPUT</alternateRegister>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>CC1S</name>
							<description>desc CC1S</description>
							<msb>1</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>IC1PSC</name>
							<description>desc IC1PSC</description>
							<msb>3</msb>
							<lsb>2</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>IC1F</name>
							<description>desc IC1F</description>
							<msb>7</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2S</name>
							<description>desc CC2S</description>
							<msb>9</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>IC2PSC</name>
							<description>desc IC2PSC</description>
							<msb>11</msb>
							<lsb>10</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>IC2F</name>
							<description>desc IC2F</description>
							<msb>15</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCMR2_OUTPUT</name>
					<description>desc CCMR2:OUTPUT</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>CC3S</name>
							<description>desc CC3S</description>
							<msb>1</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OC3FE</name>
							<description>desc OC3FE</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OC3PE</name>
							<description>desc OC3PE</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OC3M</name>
							<description>desc OC3M</description>
							<msb>6</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OC3CE</name>
							<description>desc OC3CE</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC4S</name>
							<description>desc CC4S</description>
							<msb>9</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OC4FE</name>
							<description>desc OC4FE</description>
							<msb>10</msb>
							<lsb>10</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OC4PE</name>
							<description>desc OC4PE</description>
							<msb>11</msb>
							<lsb>11</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OC4M</name>
							<description>desc OC4M</description>
							<msb>14</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OC4CE</name>
							<description>desc OC4CE</description>
							<msb>15</msb>
							<lsb>15</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCMR2_INPUT</name>
					<description>desc CCMR2:INPUT</description>
					<alternateRegister>CCMR2_OUTPUT</alternateRegister>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>CC3S</name>
							<description>desc CC3S</description>
							<msb>1</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>IC3PSC</name>
							<description>desc IC3PSC</description>
							<msb>3</msb>
							<lsb>2</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>IC3F</name>
							<description>desc IC3F</description>
							<msb>7</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC4S</name>
							<description>desc CC4S</description>
							<msb>9</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>IC4PSC</name>
							<description>desc IC4PSC</description>
							<msb>11</msb>
							<lsb>10</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>IC4F</name>
							<description>desc IC4F</description>
							<msb>15</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCER</name>
					<description>desc CCER</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0x3333</resetMask>
					<fields>
						<field>
							<name>CC1E</name>
							<description>desc CC1E</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC1P</name>
							<description>desc CC1P</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2E</name>
							<description>desc CC2E</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2P</name>
							<description>desc CC2P</description>
							<msb>5</msb>
							<lsb>5</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC3E</name>
							<description>desc CC3E</description>
							<msb>8</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC3P</name>
							<description>desc CC3P</description>
							<msb>9</msb>
							<lsb>9</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC4E</name>
							<description>desc CC4E</description>
							<msb>12</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC4P</name>
							<description>desc CC4P</description>
							<msb>13</msb>
							<lsb>13</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CNT</name>
					<description>desc CNT</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>CNT</name>
							<description>desc CNT</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PSC</name>
					<description>desc PSC</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>PSC</name>
							<description>desc PSC</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ARR</name>
					<description>desc ARR</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xFFFF</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>ARR</name>
							<description>desc ARR</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR1</name>
					<description>desc CCR1</description>
					<addressOffset>0x34</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>CCR1</name>
							<description>desc CCR1</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR2</name>
					<description>desc CCR2</description>
					<addressOffset>0x38</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>CCR2</name>
							<description>desc CCR2</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
