IOsetting/py32f0-template/Misc/py32f072xx.svd
				<register>
					<name>CCR3</name>
					<description>desc CCR3</description>
					<addressOffset>0x3C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>CCR3</name>
							<description>desc CCR3</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR4</name>
					<description>desc CCR4</description>
					<addressOffset>0x40</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>CCR4</name>
							<description>desc CCR4</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DCR</name>
					<description>desc DCR</description>
					<addressOffset>0x48</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0x1F1F</resetMask>
					<fields>
						<field>
							<name>DBA</name>
							<description>desc DBA</description>
							<msb>4</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>DBL</name>
							<description>desc DBL</description>
							<msb>12</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DMAR</name>
					<description>desc DMAR</description>
					<addressOffset>0x4C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>DMAB</name>
							<description>desc DMAB</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>TIM6</name>
			<description>desc TIM</description>
			<groupName>TIM</groupName>
			<baseAddress>0x40001000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>TIM6_LPTIM1_DAC</name>
				<description>TIM6, LPTIM1, DAC global Interrupts</description>
				<value>17</value>
			</interrupt>
			<registers>
				<register>
					<name>CR1</name>
					<description>desc CR1</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0x3FF</resetMask>
					<fields>
						<field>
							<name>CEN</name>
							<description>desc CEN</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>UDIS</name>
							<description>desc UDIS</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>URS</name>
							<description>desc URS</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OPM</name>
							<description>desc OPM</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>DIR</name>
							<description>desc DIR</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMS</name>
							<description>desc CMS</description>
							<msb>6</msb>
							<lsb>5</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ARPE</name>
							<description>desc ARPE</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CKD</name>
							<description>desc CKD</description>
							<msb>9</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CR2</name>
					<description>desc CR2</description>
					<addressOffset>0x4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xF8</resetMask>
					<fields>
						<field>
							<name>CCDS</name>
							<description>desc CCDS</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>MMS</name>
							<description>desc MMS</description>
							<msb>6</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TI1S</name>
							<description>desc TI1S</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DIER</name>
					<description>desc DIER</description>
					<addressOffset>0xC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0x5F5F</resetMask>
					<fields>
						<field>
							<name>UIE</name>
							<description>desc UIE</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC1IE</name>
							<description>desc CC1IE</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2IE</name>
							<description>desc CC2IE</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC3IE</name>
							<description>desc CC3IE</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC4IE</name>
							<description>desc CC4IE</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE</name>
							<description>desc TIE</description>
							<msb>6</msb>
							<lsb>6</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>UDE</name>
							<description>desc UDE</description>
							<msb>8</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC1DE</name>
							<description>desc CC1DE</description>
							<msb>9</msb>
							<lsb>9</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2DE</name>
							<description>desc CC2DE</description>
							<msb>10</msb>
							<lsb>10</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC3DE</name>
							<description>desc CC3DE</description>
							<msb>11</msb>
							<lsb>11</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC4DE</name>
							<description>desc CC4DE</description>
							<msb>12</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TDE</name>
							<description>desc TDE</description>
							<msb>14</msb>
							<lsb>14</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SR</name>
					<description>desc SR</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0x1E5F</resetMask>
					<fields>
						<field>
							<name>UIF</name>
							<description>desc UIF</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC1IF</name>
							<description>desc CC1IF</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2IF</name>
							<description>desc CC2IF</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC3IF</name>
							<description>desc CC3IF</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC4IF</name>
							<description>desc CC4IF</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>COMIF</name>
							<description>desc COMIF</description>
							<msb>5</msb>
							<lsb>5</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIF</name>
							<description>desc TIF</description>
							<msb>6</msb>
							<lsb>6</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>BIF</name>
							<description>desc BIF</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC1OF</name>
							<description>desc CC1OF</description>
							<msb>9</msb>
							<lsb>9</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2OF</name>
							<description>desc CC2OF</description>
							<msb>10</msb>
							<lsb>10</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC3OF</name>
							<description>desc CC3OF</description>
							<msb>11</msb>
							<lsb>11</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC4OF</name>
							<description>desc CC4OF</description>
							<msb>12</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>IC1IR</name>
							<description>desc IC1IR</description>
							<msb>16</msb>
							<lsb>16</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>IC2IR</name>
							<description>desc IC2IR</description>
							<msb>17</msb>
							<lsb>17</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>IC3IR</name>
							<description>desc IC3IR</description>
							<msb>18</msb>
							<lsb>18</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>IC4IR</name>
							<description>desc IC3IR</description>
							<msb>19</msb>
							<lsb>19</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>IC1IF</name>
							<description>desc IC1IF</description>
							<msb>20</msb>
							<lsb>20</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>IC2IF</name>
							<description>desc IC2IF</description>
							<msb>21</msb>
							<lsb>21</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>IC3IF</name>
							<description>desc IC3IF</description>
							<msb>22</msb>
							<lsb>22</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>IC4IF</name>
							<description>desc IC3IF</description>
							<msb>23</msb>
							<lsb>23</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EGR</name>
					<description>desc EGR</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0x5F</resetMask>
					<fields>
						<field>
							<name>UG</name>
							<description>desc UG</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CC1G</name>
							<description>Capture/Compare 1 Generation</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CC2G</name>
							<description>desc CC2G</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CC3G</name>
							<description>desc CC3G</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CC4G</name>
							<description>desc CC4G</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>TG</name>
							<description>desc TG</description>
							<msb>6</msb>
							<lsb>6</lsb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CNT</name>
					<description>desc CNT</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>CNT</name>
							<description>desc CNT</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PSC</name>
					<description>desc PSC</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>PSC</name>
							<description>desc PSC</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ARR</name>
					<description>desc ARR</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xFFFF</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>ARR</name>
							<description>desc ARR</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
