IOsetting/py32f0-template/Misc/py32f072xx.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="TIM6">
			<name>TIM7</name>
			<description>desc TIM</description>
			<groupName>TIM</groupName>
			<baseAddress>0x40001400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>TIM7</name>
				<description>TIM7 global Interrupt</description>
				<value>18</value>
			</interrupt>
		</peripheral>
		<peripheral>
			<name>TIM14</name>
			<description>General purpose timer</description>
			<groupName>TIM</groupName>
			<baseAddress>0x40002000</baseAddress>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>TIM14</name>
				<description>TIM14 global Interrupt</description>
				<value>19</value>
			</interrupt>
			<registers>
				<register>
					<name>CR1</name>
					<description>desc CR1</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0x3FF</resetMask>
					<fields>
						<field>
							<name>CEN</name>
							<description>desc CEN</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>UDIS</name>
							<description>desc UDIS</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>URS</name>
							<description>desc URS</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OPM</name>
							<description>desc OPM</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>DIR</name>
							<description>desc DIR</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMS</name>
							<description>desc CMS</description>
							<msb>6</msb>
							<lsb>5</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ARPE</name>
							<description>desc ARPE</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CKD</name>
							<description>desc CKD</description>
							<msb>9</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DIER</name>
					<description>desc DIER</description>
					<addressOffset>0xC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0x5F5F</resetMask>
					<fields>
						<field>
							<name>UIE</name>
							<description>desc UIE</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC1IE</name>
							<description>desc CC1IE</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2IE</name>
							<description>desc CC2IE</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC3IE</name>
							<description>desc CC3IE</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC4IE</name>
							<description>desc CC4IE</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE</name>
							<description>desc TIE</description>
							<msb>6</msb>
							<lsb>6</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>UDE</name>
							<description>desc UDE</description>
							<msb>8</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC1DE</name>
							<description>desc CC1DE</description>
							<msb>9</msb>
							<lsb>9</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2DE</name>
							<description>desc CC2DE</description>
							<msb>10</msb>
							<lsb>10</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC3DE</name>
							<description>desc CC3DE</description>
							<msb>11</msb>
							<lsb>11</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC4DE</name>
							<description>desc CC4DE</description>
							<msb>12</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TDE</name>
							<description>desc TDE</description>
							<msb>14</msb>
							<lsb>14</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SR</name>
					<description>desc SR</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0x1E5F</resetMask>
					<fields>
						<field>
							<name>UIF</name>
							<description>desc UIF</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC1IF</name>
							<description>desc CC1IF</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2IF</name>
							<description>desc CC2IF</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC3IF</name>
							<description>desc CC3IF</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC4IF</name>
							<description>desc CC4IF</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIF</name>
							<description>desc TIF</description>
							<msb>6</msb>
							<lsb>6</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC1OF</name>
							<description>desc CC1OF</description>
							<msb>9</msb>
							<lsb>9</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2OF</name>
							<description>desc CC2OF</description>
							<msb>10</msb>
							<lsb>10</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC3OF</name>
							<description>desc CC3OF</description>
							<msb>11</msb>
							<lsb>11</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC4OF</name>
							<description>desc CC4OF</description>
							<msb>12</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EGR</name>
					<description>desc EGR</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0x5F</resetMask>
					<fields>
						<field>
							<name>UG</name>
							<description>desc UG</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CC1G</name>
							<description>Capture/Compare 1 Generation</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CC2G</name>
							<description>desc CC2G</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CC3G</name>
							<description>desc CC3G</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>CC4G</name>
							<description>desc CC4G</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>write-only</access>
						</field>
						<field>
							<name>TG</name>
							<description>desc TG</description>
							<msb>6</msb>
							<lsb>6</lsb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCMR1_OUTPUT</name>
					<description>desc CCMR1:OUTPUT</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>CC1S</name>
							<description>desc CC1S</description>
							<msb>1</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OC1FE</name>
							<description>desc OC1FE</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OC1PE</name>
							<description>desc OC1PE</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OC1M</name>
							<description>desc OC1M</description>
							<msb>6</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OC1CE</name>
							<description>desc OC1CE</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2S</name>
							<description>desc CC2S</description>
							<msb>9</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OC2FE</name>
							<description>desc OC2FE</description>
							<msb>10</msb>
							<lsb>10</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OC2PE</name>
							<description>desc OC2PE</description>
							<msb>11</msb>
							<lsb>11</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OC2M</name>
							<description>desc OC2M</description>
							<msb>14</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OC2CE</name>
							<description>desc OC2CE</description>
							<msb>15</msb>
							<lsb>15</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCMR1_INPUT</name>
					<description>desc CCMR1:INPUT</description>
					<alternateRegister>CCMR1_OUTPUT</alternateRegister>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>CC1S</name>
							<description>desc CC1S</description>
							<msb>1</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>IC1PSC</name>
							<description>desc IC1PSC</description>
							<msb>3</msb>
							<lsb>2</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>IC1F</name>
							<description>desc IC1F</description>
							<msb>7</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2S</name>
							<description>desc CC2S</description>
							<msb>9</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>IC2PSC</name>
							<description>desc IC2PSC</description>
							<msb>11</msb>
							<lsb>10</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>IC2F</name>
							<description>desc IC2F</description>
							<msb>15</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCER</name>
					<description>desc CCER</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0x3333</resetMask>
					<fields>
						<field>
							<name>CC1E</name>
							<description>desc CC1E</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC1P</name>
							<description>desc CC1P</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2E</name>
							<description>desc CC2E</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2P</name>
							<description>desc CC2P</description>
							<msb>5</msb>
							<lsb>5</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC3E</name>
							<description>desc CC3E</description>
							<msb>8</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC3P</name>
							<description>desc CC3P</description>
							<msb>9</msb>
							<lsb>9</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC4E</name>
							<description>desc CC4E</description>
							<msb>12</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC4P</name>
							<description>desc CC4P</description>
							<msb>13</msb>
							<lsb>13</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CNT</name>
					<description>desc CNT</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>CNT</name>
							<description>desc CNT</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PSC</name>
					<description>desc PSC</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>PSC</name>
							<description>desc PSC</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ARR</name>
					<description>desc ARR</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xFFFF</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>ARR</name>
							<description>desc ARR</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR1</name>
					<description>desc CCR1</description>
					<addressOffset>0x34</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>CCR1</name>
							<description>desc CCR1</description>
							<msb>15</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OR</name>
					<description>desc OR</description>
					<addressOffset>0x50</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>TI1_RMP</name>
							<description>desc TI1_RMP</description>
							<msb>1</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
