IOsetting/py32f0-template/Misc/py32f072xx.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="TIM16">
			<name>TIM17</name>
			<baseAddress>0x40014800</baseAddress>
			<interrupt>
				<name>TIM17</name>
				<description>TIM17 global Interrupt</description>
				<value>22</value>
			</interrupt>
		</peripheral>
		<peripheral>
			<name>USART1</name>
			<description>
				Universal synchronous asynchronous receiver
				transmitter
			</description>
			<groupName>USART</groupName>
			<baseAddress>0x40013800</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>USART1</name>
				<description>USART1 global Interrupt</description>
				<value>27</value>
			</interrupt>
			<registers>
				<register>
					<name>SR</name>
					<description>desc SR</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xC0</resetValue>
					<fields>
						<field>
							<name>PE</name>
							<description>desc PE</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>FE</name>
							<description>desc FE</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>NE</name>
							<description>desc NE</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>ORE</name>
							<description>desc ORE</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>IDLE</name>
							<description>desc IDLE</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXNE</name>
							<description>desc RXNE</description>
							<msb>5</msb>
							<lsb>5</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TC</name>
							<description>desc TC</description>
							<msb>6</msb>
							<lsb>6</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXE</name>
							<description>desc TXE</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>LBD</name>
							<description>desc LBD</description>
							<msb>8</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTS</name>
							<description>desc CTS</description>
							<msb>9</msb>
							<lsb>9</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ABRF</name>
							<description>desc ABRF</description>
							<msb>10</msb>
							<lsb>10</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>ABRE</name>
							<description>desc ABRE</description>
							<msb>11</msb>
							<lsb>11</lsb>
							<access>read-only</access>
						</field>
						<field>
							<name>ABRRQ</name>
							<description>desc ABRRQ</description>
							<msb>12</msb>
							<lsb>12</lsb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DR</name>
					<description>desc DR</description>
					<addressOffset>0x4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>DR</name>
							<description>desc DR</description>
							<msb>8</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BRR</name>
					<description>desc BRR</description>
					<addressOffset>0x8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>DIV_FRACTION</name>
							<description>desc DIV_Fraction</description>
							<msb>3</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>DIV_MANTISSA</name>
							<description>desc DIV_Mantissa</description>
							<msb>15</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CR1</name>
					<description>desc CR1</description>
					<addressOffset>0xC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>SBK</name>
							<description>desc SBK</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>RWU</name>
							<description>desc RWU</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>RE</name>
							<description>desc RE</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TE</name>
							<description>desc TE</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>IDLEIE</name>
							<description>desc IDLEIE</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXNEIE</name>
							<description>desc RXNEIE</description>
							<msb>5</msb>
							<lsb>5</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TCIE</name>
							<description>desc TCIE</description>
							<msb>6</msb>
							<lsb>6</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXEIE</name>
							<description>desc TXEIE</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PEIE</name>
							<description>desc PEIE</description>
							<msb>8</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PS</name>
							<description>desc PS</description>
							<msb>9</msb>
							<lsb>9</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>PCE</name>
							<description>desc PCE</description>
							<msb>10</msb>
							<lsb>10</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>WAKE</name>
							<description>desc WAKE</description>
							<msb>11</msb>
							<lsb>11</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>M</name>
							<description>desc M</description>
							<msb>12</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>UE</name>
							<description>desc UE</description>
							<msb>13</msb>
							<lsb>13</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CR2</name>
					<description>desc CR2</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>ADD</name>
							<description>desc ADD</description>
							<msb>3</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>LBDL</name>
							<description>desc LBDL</description>
							<msb>5</msb>
							<lsb>5</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>LBDIE</name>
							<description>desc LBDIE</description>
							<msb>6</msb>
							<lsb>6</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>LBCL</name>
							<description>desc LBCL</description>
							<msb>8</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPHA</name>
							<description>desc CPHA</description>
							<msb>9</msb>
							<lsb>9</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPOL</name>
							<description>desc CPOL</description>
							<msb>10</msb>
							<lsb>10</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CLKEN</name>
							<description>desc CLKEN</description>
							<msb>11</msb>
							<lsb>11</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>STOP</name>
							<description>desc STOP</description>
							<msb>13</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>LINEN</name>
							<description>desc LINEN</description>
							<msb>14</msb>
							<lsb>14</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CR3</name>
					<description>desc CR3</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>EIE</name>
							<description>desc EIE</description>
							<msb>0</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>IREN</name>
							<description>desc IREN</description>
							<msb>1</msb>
							<lsb>1</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>IRLP</name>
							<description>desc IRLP</description>
							<msb>2</msb>
							<lsb>2</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>HDSEL</name>
							<description>desc HDSEL</description>
							<msb>3</msb>
							<lsb>3</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>NACK</name>
							<description>desc NACK</description>
							<msb>4</msb>
							<lsb>4</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>SCEN</name>
							<description>desc SCEN</description>
							<msb>5</msb>
							<lsb>5</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>DMAR</name>
							<description>desc DMAR</description>
							<msb>6</msb>
							<lsb>6</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>DMAT</name>
							<description>desc DMAT</description>
							<msb>7</msb>
							<lsb>7</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>RTSE</name>
							<description>desc RTSE</description>
							<msb>8</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTSE</name>
							<description>desc CTSE</description>
							<msb>9</msb>
							<lsb>9</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTSIE</name>
							<description>desc CTSIE</description>
							<msb>10</msb>
							<lsb>10</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>OVER8</name>
							<description>desc OVER8</description>
							<msb>11</msb>
							<lsb>11</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ABREN</name>
							<description>desc ABREN</description>
							<msb>12</msb>
							<lsb>12</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>ABRMODE</name>
							<description>desc ABRMODE</description>
							<msb>14</msb>
							<lsb>13</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GTPR</name>
					<description>desc GTPR</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>PSC</name>
							<description>desc PSC</description>
							<msb>7</msb>
							<lsb>0</lsb>
							<access>read-write</access>
						</field>
						<field>
							<name>GT</name>
							<description>desc GT</description>
							<msb>15</msb>
							<lsb>8</lsb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
