IOsetting/py32f0-template/Misc/py32f072xx.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="USART1">
			<name>USART2</name>
			<baseAddress>0x40004400</baseAddress>
			<interrupt>
				<name>USART2</name>
				<description>USART2 global Interrupt</description>
				<value>28</value>
			</interrupt>
		</peripheral>
		<peripheral derivedFrom="USART1">
			<name>USART3</name>
			<description>desc USART</description>
			<groupName>USART</groupName>
			<baseAddress>0x40004800</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>USART3_4</name>
				<description>USART3, 4 global Interrupts</description>
				<value>29</value>
			</interrupt>
		</peripheral>
		<peripheral derivedFrom="USART1">
			<name>USART4</name>
			<description>desc USART</description>
			<groupName>USART</groupName>
			<baseAddress>0x40004C00</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>USART3_4</name>
				<description>USART3, 4 global Interrupts</description>
				<value>29</value>
			</interrupt>
		</peripheral>
		<peripheral>
			<name>USB</name>
			<description>USB</description>
			<groupName>USB</groupName>
			<baseAddress>0x40005C00</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>USB</name>
				<description>USB global Interrupts</description>
				<value>31</value>
			</interrupt>
			<registers>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>CR</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFFFFFFFF</resetValue>
					<fields>
						<field>
							<name>ADD</name>
							<description>ADD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
						<field>
							<name>UPDATE</name>
							<description>UPDATE</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>Enable_Suspend</name>
							<description>Enable_Suspend</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>Suspend_Mode</name>
							<description>Suspend_Mode</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>Resume</name>
							<description>Resume</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>Reset</name>
							<description>Reset</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ISO_Update</name>
							<description>ISO_Update</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>INTR</name>
					<displayName>INTR</displayName>
					<description>INTR</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>Suspend</name>
							<description>Suspend</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>Resume</name>
							<description>Resume</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>Reset</name>
							<description>Reset</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SOF</name>
							<description>SOF</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP1OUT</name>
							<description>EP1OUT</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP2OUT</name>
							<description>EP2OUT</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP3OUT</name>
							<description>EP3OUT</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP4OUT</name>
							<description>EP4OUT</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP5OUT</name>
							<description>EP5OUT</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP0</name>
							<description>EP0</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP1IN</name>
							<description>EP1IN</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP2IN</name>
							<description>EP2IN</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP3IN</name>
							<description>EP3IN</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP4IN</name>
							<description>EP4IN</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP5IN</name>
							<description>EP5IN</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>INTRE</name>
					<displayName>INTRE</displayName>
					<description>INTRE</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EN_Suspend</name>
							<description>EN_Suspend</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EN_Resume</name>
							<description>EN_Resume</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EN_Reset</name>
							<description>EN_Reset</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EN_SOF</name>
							<description>EN_SOF</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP1OUTE</name>
							<description>EP1OUTE</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP2OUTE</name>
							<description>EP2OUTE</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP3OUTE</name>
							<description>EP3OUTE</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP4OUTE</name>
							<description>EP4OUTE</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP5OUTE</name>
							<description>EP5OUTE</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP0</name>
							<description>EP0</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP1INE</name>
							<description>EP1INE</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP2INE</name>
							<description>EP2INE</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP3INE</name>
							<description>EP3INE</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP4INE</name>
							<description>EP4INE</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EP5INE</name>
							<description>EP5INE</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>FRAME</name>
					<displayName>FRAME</displayName>
					<description>FRAME</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FramNUM</name>
							<description>FramNUM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>11</bitWidth>
						</field>
						<field>
							<name>INDEX</name>
							<description>INDEX</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EP0CSR</name>
					<displayName>EP0CSR</displayName>
					<description>EP0CSR</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>OutPktRdy</name>
							<description>OutPktRdy</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>InPktRdy</name>
							<description>InPktRdy</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SentStall</name>
							<description>SentStall</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DataEnd</name>
							<description>DataEnd</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SetupEnd</name>
							<description>SetupEnd</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SendStall</name>
							<description>OutPktRdy</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ServicedOutPktRdy</name>
							<description>ServicedOutPktRdy</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ServicedSetupEnd</name>
							<description>ServicedSetupEnd</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>COUNT0</name>
							<description>COUNT0</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>INEPxCSR</name>
					<displayName>INEPxCSR</displayName>
					<description>INEPxCSR</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FrcDataTog</name>
							<description>FrcDataTog</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMAEnab</name>
							<description>DMAEnab</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>Mode</name>
							<description>Mode</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ISO</name>
							<description>ISO</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AutoSet</name>
							<description>AutoSet</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>InPktRdy</name>
							<description>InPktRdy</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FIFONotEmpty</name>
							<description>FIFONotEmpty</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UnderRun</name>
							<description>UnderRun</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FlushFIFO</name>
							<description>FlushFIFO</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SendStall</name>
							<description>SendStall</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SentStall</name>
							<description>SentStall</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ClrDataTog</name>
							<description>ClrDataTog</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>INMAXP</name>
							<description>INMAXP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OUTEPxCSR</name>
					<displayName>OUTEPxCSR</displayName>
					<description>OUTEPxCSR</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DMAMode</name>
							<description>DMAMode</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMAEnab</name>
							<description>DMAEnab</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ISO</name>
							<description>ISO</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AutoClear</name>
							<description>AutoClear</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OutPktRdy</name>
							<description>OutPktRdy</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FIFOFull</name>
							<description>FIFOFull</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OverRun</name>
							<description>OverRun</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DataError</name>
							<description>DataError</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FlushFIFO</name>
							<description>FlushFIFO</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SendStall</name>
							<description>SendStall</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SentStall</name>
							<description>SentStall</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ClrDataTog</name>
							<description>ClrDataTog</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>INMAXP</name>
							<description>INMAXP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OUTCOUNT</name>
					<displayName>OUTCOUNT</displayName>
					<description>OUTCOUNT</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>OUTCOUNT</name>
							<description>OUTCOUNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>10</bitWidth>
						</field>
					</fields>
				</register>
