IOsetting/py32f0-template/Misc/py32f072xx.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>WWDG</name>
			<description>Window watchdog</description>
			<groupName>WWDG</groupName>
			<baseAddress>0x40002C00</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>WWDG</name>
				<description>Window WatchDog Interrupt</description>
				<value>0</value>
			</interrupt>
			<registers>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>Control register (WWDG_CR)</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000007F</resetValue>
					<fields>
						<field>
							<name>WDGA</name>
							<description>Activation bit</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>T</name>
							<description>7-bit counter (MSB to LSB)</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CFR</name>
					<displayName>CFR</displayName>
					<description>
						Configuration register
						(WWDG_CFR)
					</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000007F</resetValue>
					<fields>
						<field>
							<name>EWI</name>
							<description>Early Wakeup Interrupt</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WDGTB</name>
							<description>Timer Base</description>
							<bitOffset>7</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>W</name>
							<description>7-bit window value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SR</name>
					<displayName>SR</displayName>
					<description>Status register (WWDG_SR)</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EWIF</name>
							<description>Early Wakeup Interrupt flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
	</peripherals>
</device>
